/* automatically generated by rust-bindgen 0.68.1 */

pub const __GNUC_VA_LIST: u32 = 1;
pub const SQLITE_VERSION: &[u8; 7] = b"3.45.0\0";
pub const SQLITE_VERSION_NUMBER: u32 = 3045000;
pub const SQLITE_SOURCE_ID: &[u8; 85] =
    b"2023-12-20 19:33:41 029a05cd2928d43d81e4549cce5388c432e2c9e75e3fa0b2fe6e91021b2fb9ac\0";
pub const SQLITE_OK: u32 = 0;
pub const SQLITE_ERROR: u32 = 1;
pub const SQLITE_INTERNAL: u32 = 2;
pub const SQLITE_PERM: u32 = 3;
pub const SQLITE_ABORT: u32 = 4;
pub const SQLITE_BUSY: u32 = 5;
pub const SQLITE_LOCKED: u32 = 6;
pub const SQLITE_NOMEM: u32 = 7;
pub const SQLITE_READONLY: u32 = 8;
pub const SQLITE_INTERRUPT: u32 = 9;
pub const SQLITE_IOERR: u32 = 10;
pub const SQLITE_CORRUPT: u32 = 11;
pub const SQLITE_NOTFOUND: u32 = 12;
pub const SQLITE_FULL: u32 = 13;
pub const SQLITE_CANTOPEN: u32 = 14;
pub const SQLITE_PROTOCOL: u32 = 15;
pub const SQLITE_EMPTY: u32 = 16;
pub const SQLITE_SCHEMA: u32 = 17;
pub const SQLITE_TOOBIG: u32 = 18;
pub const SQLITE_CONSTRAINT: u32 = 19;
pub const SQLITE_MISMATCH: u32 = 20;
pub const SQLITE_MISUSE: u32 = 21;
pub const SQLITE_NOLFS: u32 = 22;
pub const SQLITE_AUTH: u32 = 23;
pub const SQLITE_FORMAT: u32 = 24;
pub const SQLITE_RANGE: u32 = 25;
pub const SQLITE_NOTADB: u32 = 26;
pub const SQLITE_NOTICE: u32 = 27;
pub const SQLITE_WARNING: u32 = 28;
pub const SQLITE_ROW: u32 = 100;
pub const SQLITE_DONE: u32 = 101;
pub const SQLITE_ERROR_MISSING_COLLSEQ: u32 = 257;
pub const SQLITE_ERROR_RETRY: u32 = 513;

pub const SQLITE_SCANSTAT_EXPLAIN: u32 = 4;
pub const SQLITE_SCANSTAT_SELECTID: u32 = 5;
pub const SQLITE_SCANSTAT_PARENTID: u32 = 6;
pub const SQLITE_SCANSTAT_NCYCLE: u32 = 7;
pub const SQLITE_SCANSTAT_COMPLEX: u32 = 1;
pub const SQLITE_SERIALIZE_NOCOPY: u32 = 1;
pub const SQLITE_DESERIALIZE_FREEONCLOSE: u32 = 1;
pub const SQLITE_DESERIALIZE_RESIZEABLE: u32 = 2;
pub const SQLITE_DESERIALIZE_READONLY: u32 = 4;
pub const NOT_WITHIN: u32 = 0;
pub const PARTLY_WITHIN: u32 = 1;
pub const FULLY_WITHIN: u32 = 2;
pub const FTS5_TOKENIZE_QUERY: u32 = 1;
pub const FTS5_TOKENIZE_PREFIX: u32 = 2;
pub const FTS5_TOKENIZE_DOCUMENT: u32 = 4;
pub const FTS5_TOKENIZE_AUX: u32 = 8;
pub const FTS5_TOKEN_COLOCATED: u32 = 1;
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
extern "C" {
    pub static sqlite3_version: [::core::ffi::c_char; 0usize];
}
extern "C" {
    pub fn sqlite3_libversion() -> *const ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_sourceid() -> *const ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_libversion_number() -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_compileoption_used(zOptName: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_compileoption_get(N: ::core::ffi::c_int) -> *const ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_threadsafe() -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3 {
    _unused: [u8; 0],
}
pub type sqlite_int64 = ::core::ffi::c_longlong;
pub type sqlite_uint64 = ::core::ffi::c_ulonglong;
pub type sqlite3_int64 = sqlite_int64;
pub type sqlite3_uint64 = sqlite_uint64;
extern "C" {
    pub fn sqlite3_close(arg1: *mut sqlite3) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_close_v2(arg1: *mut sqlite3) -> ::core::ffi::c_int;
}
pub type sqlite3_callback = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::core::ffi::c_void,
        arg2: ::core::ffi::c_int,
        arg3: *mut *mut ::core::ffi::c_char,
        arg4: *mut *mut ::core::ffi::c_char,
    ) -> ::core::ffi::c_int,
>;
extern "C" {
    pub fn sqlite3_exec(
        arg1: *mut sqlite3,
        sql: *const ::core::ffi::c_char,
        callback: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: ::core::ffi::c_int,
                arg3: *mut *mut ::core::ffi::c_char,
                arg4: *mut *mut ::core::ffi::c_char,
            ) -> ::core::ffi::c_int,
        >,
        arg2: *mut ::core::ffi::c_void,
        errmsg: *mut *mut ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_file {
    pub pMethods: *const sqlite3_io_methods,
}
#[test]
fn bindgen_test_layout_sqlite3_file() {
    const UNINIT: ::core::mem::MaybeUninit<sqlite3_file> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sqlite3_file>(),
        4usize,
        concat!("Size of: ", stringify!(sqlite3_file))
    );
    assert_eq!(
        ::core::mem::align_of::<sqlite3_file>(),
        4usize,
        concat!("Alignment of ", stringify!(sqlite3_file))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pMethods) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_file),
            "::",
            stringify!(pMethods)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_io_methods {
    pub iVersion: ::core::ffi::c_int,
    pub xClose:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_file) -> ::core::ffi::c_int>,
    pub xRead: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            arg2: *mut ::core::ffi::c_void,
            iAmt: ::core::ffi::c_int,
            iOfst: sqlite3_int64,
        ) -> ::core::ffi::c_int,
    >,
    pub xWrite: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            arg2: *const ::core::ffi::c_void,
            iAmt: ::core::ffi::c_int,
            iOfst: sqlite3_int64,
        ) -> ::core::ffi::c_int,
    >,
    pub xTruncate: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_file, size: sqlite3_int64) -> ::core::ffi::c_int,
    >,
    pub xSync: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            flags: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xFileSize: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            pSize: *mut sqlite3_int64,
        ) -> ::core::ffi::c_int,
    >,
    pub xLock: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            arg2: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xUnlock: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            arg2: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xCheckReservedLock: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            pResOut: *mut ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xFileControl: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            op: ::core::ffi::c_int,
            pArg: *mut ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
    pub xSectorSize:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_file) -> ::core::ffi::c_int>,
    pub xDeviceCharacteristics:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_file) -> ::core::ffi::c_int>,
    pub xShmMap: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            iPg: ::core::ffi::c_int,
            pgsz: ::core::ffi::c_int,
            arg2: ::core::ffi::c_int,
            arg3: *mut *mut ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
    pub xShmLock: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            offset: ::core::ffi::c_int,
            n: ::core::ffi::c_int,
            flags: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xShmBarrier: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_file)>,
    pub xShmUnmap: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            deleteFlag: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xFetch: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            iOfst: sqlite3_int64,
            iAmt: ::core::ffi::c_int,
            pp: *mut *mut ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
    pub xUnfetch: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_file,
            iOfst: sqlite3_int64,
            p: *mut ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
}
#[test]
fn bindgen_test_layout_sqlite3_io_methods() {
    const UNINIT: ::core::mem::MaybeUninit<sqlite3_io_methods> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sqlite3_io_methods>(),
        76usize,
        concat!("Size of: ", stringify!(sqlite3_io_methods))
    );
    assert_eq!(
        ::core::mem::align_of::<sqlite3_io_methods>(),
        4usize,
        concat!("Alignment of ", stringify!(sqlite3_io_methods))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_io_methods),
            "::",
            stringify!(iVersion)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xClose) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_io_methods),
            "::",
            stringify!(xClose)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xRead) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_io_methods),
            "::",
            stringify!(xRead)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xWrite) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_io_methods),
            "::",
            stringify!(xWrite)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xTruncate) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_io_methods),
            "::",
            stringify!(xTruncate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xSync) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_io_methods),
            "::",
            stringify!(xSync)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xFileSize) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_io_methods),
            "::",
            stringify!(xFileSize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xLock) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_io_methods),
            "::",
            stringify!(xLock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xUnlock) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_io_methods),
            "::",
            stringify!(xUnlock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xCheckReservedLock) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_io_methods),
            "::",
            stringify!(xCheckReservedLock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xFileControl) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_io_methods),
            "::",
            stringify!(xFileControl)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xSectorSize) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_io_methods),
            "::",
            stringify!(xSectorSize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xDeviceCharacteristics) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_io_methods),
            "::",
            stringify!(xDeviceCharacteristics)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xShmMap) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_io_methods),
            "::",
            stringify!(xShmMap)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xShmLock) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_io_methods),
            "::",
            stringify!(xShmLock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xShmBarrier) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_io_methods),
            "::",
            stringify!(xShmBarrier)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xShmUnmap) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_io_methods),
            "::",
            stringify!(xShmUnmap)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xFetch) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_io_methods),
            "::",
            stringify!(xFetch)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xUnfetch) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_io_methods),
            "::",
            stringify!(xUnfetch)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_mutex {
    _unused: [u8; 0],
}
pub type sqlite3_filename = *const ::core::ffi::c_char;
pub type sqlite3_syscall_ptr = ::core::option::Option<unsafe extern "C" fn()>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_vfs {
    pub iVersion: ::core::ffi::c_int,
    pub szOsFile: ::core::ffi::c_int,
    pub mxPathname: ::core::ffi::c_int,
    pub pNext: *mut sqlite3_vfs,
    pub zName: *const ::core::ffi::c_char,
    pub pAppData: *mut ::core::ffi::c_void,
    pub xOpen: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            zName: sqlite3_filename,
            arg2: *mut sqlite3_file,
            flags: ::core::ffi::c_int,
            pOutFlags: *mut ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xDelete: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            zName: *const ::core::ffi::c_char,
            syncDir: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xAccess: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            zName: *const ::core::ffi::c_char,
            flags: ::core::ffi::c_int,
            pResOut: *mut ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xFullPathname: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            zName: *const ::core::ffi::c_char,
            nOut: ::core::ffi::c_int,
            zOut: *mut ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub xDlOpen: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            zFilename: *const ::core::ffi::c_char,
        ) -> *mut ::core::ffi::c_void,
    >,
    pub xDlError: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            nByte: ::core::ffi::c_int,
            zErrMsg: *mut ::core::ffi::c_char,
        ),
    >,
    pub xDlSym: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            arg2: *mut ::core::ffi::c_void,
            zSymbol: *const ::core::ffi::c_char,
        ) -> ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut sqlite3_vfs,
                arg2: *mut ::core::ffi::c_void,
                zSymbol: *const ::core::ffi::c_char,
            ),
        >,
    >,
    pub xDlClose: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_vfs, arg2: *mut ::core::ffi::c_void),
    >,
    pub xRandomness: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            nByte: ::core::ffi::c_int,
            zOut: *mut ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub xSleep: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            microseconds: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xCurrentTime: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_vfs, arg2: *mut f64) -> ::core::ffi::c_int,
    >,
    pub xGetLastError: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            arg2: ::core::ffi::c_int,
            arg3: *mut ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub xCurrentTimeInt64: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            arg2: *mut sqlite3_int64,
        ) -> ::core::ffi::c_int,
    >,
    pub xSetSystemCall: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            zName: *const ::core::ffi::c_char,
            arg2: sqlite3_syscall_ptr,
        ) -> ::core::ffi::c_int,
    >,
    pub xGetSystemCall: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            zName: *const ::core::ffi::c_char,
        ) -> sqlite3_syscall_ptr,
    >,
    pub xNextSystemCall: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            zName: *const ::core::ffi::c_char,
        ) -> *const ::core::ffi::c_char,
    >,
}
#[test]
fn bindgen_test_layout_sqlite3_vfs() {
    const UNINIT: ::core::mem::MaybeUninit<sqlite3_vfs> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sqlite3_vfs>(),
        88usize,
        concat!("Size of: ", stringify!(sqlite3_vfs))
    );
    assert_eq!(
        ::core::mem::align_of::<sqlite3_vfs>(),
        4usize,
        concat!("Alignment of ", stringify!(sqlite3_vfs))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vfs),
            "::",
            stringify!(iVersion)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).szOsFile) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vfs),
            "::",
            stringify!(szOsFile)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mxPathname) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vfs),
            "::",
            stringify!(mxPathname)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pNext) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vfs),
            "::",
            stringify!(pNext)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).zName) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vfs),
            "::",
            stringify!(zName)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pAppData) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vfs),
            "::",
            stringify!(pAppData)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xOpen) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vfs),
            "::",
            stringify!(xOpen)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xDelete) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vfs),
            "::",
            stringify!(xDelete)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xAccess) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vfs),
            "::",
            stringify!(xAccess)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xFullPathname) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vfs),
            "::",
            stringify!(xFullPathname)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xDlOpen) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vfs),
            "::",
            stringify!(xDlOpen)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xDlError) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vfs),
            "::",
            stringify!(xDlError)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xDlSym) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vfs),
            "::",
            stringify!(xDlSym)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xDlClose) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vfs),
            "::",
            stringify!(xDlClose)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xRandomness) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vfs),
            "::",
            stringify!(xRandomness)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xSleep) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vfs),
            "::",
            stringify!(xSleep)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xCurrentTime) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vfs),
            "::",
            stringify!(xCurrentTime)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xGetLastError) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vfs),
            "::",
            stringify!(xGetLastError)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xCurrentTimeInt64) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vfs),
            "::",
            stringify!(xCurrentTimeInt64)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xSetSystemCall) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vfs),
            "::",
            stringify!(xSetSystemCall)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xGetSystemCall) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vfs),
            "::",
            stringify!(xGetSystemCall)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xNextSystemCall) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vfs),
            "::",
            stringify!(xNextSystemCall)
        )
    );
}
extern "C" {
    pub fn sqlite3_initialize() -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_shutdown() -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_os_init() -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_os_end() -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_config(arg1: ::core::ffi::c_int, ...) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_db_config(arg1: *mut sqlite3, op: ::core::ffi::c_int, ...)
        -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_mem_methods {
    pub xMalloc: ::core::option::Option<
        unsafe extern "C" fn(arg1: ::core::ffi::c_int) -> *mut ::core::ffi::c_void,
    >,
    pub xFree: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    pub xRealloc: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::core::ffi::c_void,
            arg2: ::core::ffi::c_int,
        ) -> *mut ::core::ffi::c_void,
    >,
    pub xSize: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
    >,
    pub xRoundup: ::core::option::Option<
        unsafe extern "C" fn(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int,
    >,
    pub xInit: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
    >,
    pub xShutdown: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    pub pAppData: *mut ::core::ffi::c_void,
}
#[test]
fn bindgen_test_layout_sqlite3_mem_methods() {
    const UNINIT: ::core::mem::MaybeUninit<sqlite3_mem_methods> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sqlite3_mem_methods>(),
        32usize,
        concat!("Size of: ", stringify!(sqlite3_mem_methods))
    );
    assert_eq!(
        ::core::mem::align_of::<sqlite3_mem_methods>(),
        4usize,
        concat!("Alignment of ", stringify!(sqlite3_mem_methods))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xMalloc) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_mem_methods),
            "::",
            stringify!(xMalloc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xFree) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_mem_methods),
            "::",
            stringify!(xFree)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xRealloc) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_mem_methods),
            "::",
            stringify!(xRealloc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xSize) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_mem_methods),
            "::",
            stringify!(xSize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xRoundup) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_mem_methods),
            "::",
            stringify!(xRoundup)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xInit) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_mem_methods),
            "::",
            stringify!(xInit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xShutdown) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_mem_methods),
            "::",
            stringify!(xShutdown)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pAppData) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_mem_methods),
            "::",
            stringify!(pAppData)
        )
    );
}
extern "C" {
    pub fn sqlite3_extended_result_codes(
        arg1: *mut sqlite3,
        onoff: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_last_insert_rowid(arg1: *mut sqlite3) -> sqlite3_int64;
}
extern "C" {
    pub fn sqlite3_set_last_insert_rowid(arg1: *mut sqlite3, arg2: sqlite3_int64);
}
extern "C" {
    pub fn sqlite3_changes(arg1: *mut sqlite3) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_changes64(arg1: *mut sqlite3) -> sqlite3_int64;
}
extern "C" {
    pub fn sqlite3_total_changes(arg1: *mut sqlite3) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_total_changes64(arg1: *mut sqlite3) -> sqlite3_int64;
}
extern "C" {
    pub fn sqlite3_interrupt(arg1: *mut sqlite3);
}
extern "C" {
    pub fn sqlite3_is_interrupted(arg1: *mut sqlite3) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_complete(sql: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_complete16(sql: *const ::core::ffi::c_void) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_busy_handler(
        arg1: *mut sqlite3,
        arg2: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: ::core::ffi::c_int,
            ) -> ::core::ffi::c_int,
        >,
        arg3: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_busy_timeout(arg1: *mut sqlite3, ms: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_get_table(
        db: *mut sqlite3,
        zSql: *const ::core::ffi::c_char,
        pazResult: *mut *mut *mut ::core::ffi::c_char,
        pnRow: *mut ::core::ffi::c_int,
        pnColumn: *mut ::core::ffi::c_int,
        pzErrmsg: *mut *mut ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_free_table(result: *mut *mut ::core::ffi::c_char);
}
extern "C" {
    pub fn sqlite3_mprintf(arg1: *const ::core::ffi::c_char, ...) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_vmprintf(
        arg1: *const ::core::ffi::c_char,
        arg2: va_list,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_snprintf(
        arg1: ::core::ffi::c_int,
        arg2: *mut ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_vsnprintf(
        arg1: ::core::ffi::c_int,
        arg2: *mut ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        arg4: va_list,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_malloc(arg1: ::core::ffi::c_int) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_malloc64(arg1: sqlite3_uint64) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_realloc(
        arg1: *mut ::core::ffi::c_void,
        arg2: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_realloc64(
        arg1: *mut ::core::ffi::c_void,
        arg2: sqlite3_uint64,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_free(arg1: *mut ::core::ffi::c_void);
}
extern "C" {
    pub fn sqlite3_msize(arg1: *mut ::core::ffi::c_void) -> sqlite3_uint64;
}
extern "C" {
    pub fn sqlite3_memory_used() -> sqlite3_int64;
}
extern "C" {
    pub fn sqlite3_memory_highwater(resetFlag: ::core::ffi::c_int) -> sqlite3_int64;
}
extern "C" {
    pub fn sqlite3_randomness(N: ::core::ffi::c_int, P: *mut ::core::ffi::c_void);
}
extern "C" {
    pub fn sqlite3_set_authorizer(
        arg1: *mut sqlite3,
        xAuth: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: ::core::ffi::c_int,
                arg3: *const ::core::ffi::c_char,
                arg4: *const ::core::ffi::c_char,
                arg5: *const ::core::ffi::c_char,
                arg6: *const ::core::ffi::c_char,
            ) -> ::core::ffi::c_int,
        >,
        pUserData: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_trace(
        arg1: *mut sqlite3,
        xTrace: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void, arg2: *const ::core::ffi::c_char),
        >,
        arg2: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_profile(
        arg1: *mut sqlite3,
        xProfile: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: *const ::core::ffi::c_char,
                arg3: sqlite3_uint64,
            ),
        >,
        arg2: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_trace_v2(
        arg1: *mut sqlite3,
        uMask: ::core::ffi::c_uint,
        xCallback: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: ::core::ffi::c_uint,
                arg2: *mut ::core::ffi::c_void,
                arg3: *mut ::core::ffi::c_void,
                arg4: *mut ::core::ffi::c_void,
            ) -> ::core::ffi::c_int,
        >,
        pCtx: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_progress_handler(
        arg1: *mut sqlite3,
        arg2: ::core::ffi::c_int,
        arg3: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
        >,
        arg4: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    pub fn sqlite3_open(
        filename: *const ::core::ffi::c_char,
        ppDb: *mut *mut sqlite3,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_open16(
        filename: *const ::core::ffi::c_void,
        ppDb: *mut *mut sqlite3,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_open_v2(
        filename: *const ::core::ffi::c_char,
        ppDb: *mut *mut sqlite3,
        flags: ::core::ffi::c_int,
        zVfs: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_uri_parameter(
        z: sqlite3_filename,
        zParam: *const ::core::ffi::c_char,
    ) -> *const ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_uri_boolean(
        z: sqlite3_filename,
        zParam: *const ::core::ffi::c_char,
        bDefault: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_uri_int64(
        arg1: sqlite3_filename,
        arg2: *const ::core::ffi::c_char,
        arg3: sqlite3_int64,
    ) -> sqlite3_int64;
}
extern "C" {
    pub fn sqlite3_uri_key(
        z: sqlite3_filename,
        N: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_filename_database(arg1: sqlite3_filename) -> *const ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_filename_journal(arg1: sqlite3_filename) -> *const ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_filename_wal(arg1: sqlite3_filename) -> *const ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_database_file_object(arg1: *const ::core::ffi::c_char) -> *mut sqlite3_file;
}
extern "C" {
    pub fn sqlite3_create_filename(
        zDatabase: *const ::core::ffi::c_char,
        zJournal: *const ::core::ffi::c_char,
        zWal: *const ::core::ffi::c_char,
        nParam: ::core::ffi::c_int,
        azParam: *mut *const ::core::ffi::c_char,
    ) -> sqlite3_filename;
}
extern "C" {
    pub fn sqlite3_free_filename(arg1: sqlite3_filename);
}
extern "C" {
    pub fn sqlite3_errcode(db: *mut sqlite3) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_extended_errcode(db: *mut sqlite3) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_errmsg(arg1: *mut sqlite3) -> *const ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_errmsg16(arg1: *mut sqlite3) -> *const ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_errstr(arg1: ::core::ffi::c_int) -> *const ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_error_offset(db: *mut sqlite3) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_stmt {
    _unused: [u8; 0],
}
extern "C" {
    pub fn sqlite3_limit(
        arg1: *mut sqlite3,
        id: ::core::ffi::c_int,
        newVal: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_prepare(
        db: *mut sqlite3,
        zSql: *const ::core::ffi::c_char,
        nByte: ::core::ffi::c_int,
        ppStmt: *mut *mut sqlite3_stmt,
        pzTail: *mut *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_prepare_v2(
        db: *mut sqlite3,
        zSql: *const ::core::ffi::c_char,
        nByte: ::core::ffi::c_int,
        ppStmt: *mut *mut sqlite3_stmt,
        pzTail: *mut *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_prepare_v3(
        db: *mut sqlite3,
        zSql: *const ::core::ffi::c_char,
        nByte: ::core::ffi::c_int,
        prepFlags: ::core::ffi::c_uint,
        ppStmt: *mut *mut sqlite3_stmt,
        pzTail: *mut *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_prepare16(
        db: *mut sqlite3,
        zSql: *const ::core::ffi::c_void,
        nByte: ::core::ffi::c_int,
        ppStmt: *mut *mut sqlite3_stmt,
        pzTail: *mut *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_prepare16_v2(
        db: *mut sqlite3,
        zSql: *const ::core::ffi::c_void,
        nByte: ::core::ffi::c_int,
        ppStmt: *mut *mut sqlite3_stmt,
        pzTail: *mut *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_prepare16_v3(
        db: *mut sqlite3,
        zSql: *const ::core::ffi::c_void,
        nByte: ::core::ffi::c_int,
        prepFlags: ::core::ffi::c_uint,
        ppStmt: *mut *mut sqlite3_stmt,
        pzTail: *mut *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_sql(pStmt: *mut sqlite3_stmt) -> *const ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_expanded_sql(pStmt: *mut sqlite3_stmt) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_stmt_readonly(pStmt: *mut sqlite3_stmt) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_stmt_isexplain(pStmt: *mut sqlite3_stmt) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_stmt_explain(
        pStmt: *mut sqlite3_stmt,
        eMode: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_stmt_busy(arg1: *mut sqlite3_stmt) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_value {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_context {
    _unused: [u8; 0],
}
extern "C" {
    pub fn sqlite3_bind_blob(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
        arg3: *const ::core::ffi::c_void,
        n: ::core::ffi::c_int,
        arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_bind_blob64(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
        arg3: *const ::core::ffi::c_void,
        arg4: sqlite3_uint64,
        arg5: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_bind_double(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
        arg3: f64,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_bind_int(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
        arg3: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_bind_int64(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
        arg3: sqlite3_int64,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_bind_null(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_bind_text(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
        arg3: *const ::core::ffi::c_char,
        arg4: ::core::ffi::c_int,
        arg5: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_bind_text16(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
        arg3: *const ::core::ffi::c_void,
        arg4: ::core::ffi::c_int,
        arg5: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_bind_text64(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
        arg3: *const ::core::ffi::c_char,
        arg4: sqlite3_uint64,
        arg5: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        encoding: ::core::ffi::c_uchar,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_bind_value(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
        arg3: *const sqlite3_value,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_bind_pointer(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
        arg3: *mut ::core::ffi::c_void,
        arg4: *const ::core::ffi::c_char,
        arg5: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_bind_zeroblob(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
        n: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_bind_zeroblob64(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
        arg3: sqlite3_uint64,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_bind_parameter_count(arg1: *mut sqlite3_stmt) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_bind_parameter_name(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_bind_parameter_index(
        arg1: *mut sqlite3_stmt,
        zName: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_clear_bindings(arg1: *mut sqlite3_stmt) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_column_count(pStmt: *mut sqlite3_stmt) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_column_name(
        arg1: *mut sqlite3_stmt,
        N: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_column_name16(
        arg1: *mut sqlite3_stmt,
        N: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_column_database_name(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_column_database_name16(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_column_table_name(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_column_table_name16(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_column_origin_name(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_column_origin_name16(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_column_decltype(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_column_decltype16(
        arg1: *mut sqlite3_stmt,
        arg2: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_step(arg1: *mut sqlite3_stmt) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_data_count(pStmt: *mut sqlite3_stmt) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_column_blob(
        arg1: *mut sqlite3_stmt,
        iCol: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_column_double(arg1: *mut sqlite3_stmt, iCol: ::core::ffi::c_int) -> f64;
}
extern "C" {
    pub fn sqlite3_column_int(
        arg1: *mut sqlite3_stmt,
        iCol: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_column_int64(arg1: *mut sqlite3_stmt, iCol: ::core::ffi::c_int)
        -> sqlite3_int64;
}
extern "C" {
    pub fn sqlite3_column_text(
        arg1: *mut sqlite3_stmt,
        iCol: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_uchar;
}
extern "C" {
    pub fn sqlite3_column_text16(
        arg1: *mut sqlite3_stmt,
        iCol: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_column_value(
        arg1: *mut sqlite3_stmt,
        iCol: ::core::ffi::c_int,
    ) -> *mut sqlite3_value;
}
extern "C" {
    pub fn sqlite3_column_bytes(
        arg1: *mut sqlite3_stmt,
        iCol: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_column_bytes16(
        arg1: *mut sqlite3_stmt,
        iCol: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_column_type(
        arg1: *mut sqlite3_stmt,
        iCol: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_finalize(pStmt: *mut sqlite3_stmt) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_reset(pStmt: *mut sqlite3_stmt) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_create_function(
        db: *mut sqlite3,
        zFunctionName: *const ::core::ffi::c_char,
        nArg: ::core::ffi::c_int,
        eTextRep: ::core::ffi::c_int,
        pApp: *mut ::core::ffi::c_void,
        xFunc: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut sqlite3_context,
                arg2: ::core::ffi::c_int,
                arg3: *mut *mut sqlite3_value,
            ),
        >,
        xStep: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut sqlite3_context,
                arg2: ::core::ffi::c_int,
                arg3: *mut *mut sqlite3_value,
            ),
        >,
        xFinal: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_context)>,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_create_function16(
        db: *mut sqlite3,
        zFunctionName: *const ::core::ffi::c_void,
        nArg: ::core::ffi::c_int,
        eTextRep: ::core::ffi::c_int,
        pApp: *mut ::core::ffi::c_void,
        xFunc: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut sqlite3_context,
                arg2: ::core::ffi::c_int,
                arg3: *mut *mut sqlite3_value,
            ),
        >,
        xStep: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut sqlite3_context,
                arg2: ::core::ffi::c_int,
                arg3: *mut *mut sqlite3_value,
            ),
        >,
        xFinal: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_context)>,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_create_function_v2(
        db: *mut sqlite3,
        zFunctionName: *const ::core::ffi::c_char,
        nArg: ::core::ffi::c_int,
        eTextRep: ::core::ffi::c_int,
        pApp: *mut ::core::ffi::c_void,
        xFunc: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut sqlite3_context,
                arg2: ::core::ffi::c_int,
                arg3: *mut *mut sqlite3_value,
            ),
        >,
        xStep: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut sqlite3_context,
                arg2: ::core::ffi::c_int,
                arg3: *mut *mut sqlite3_value,
            ),
        >,
        xFinal: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_context)>,
        xDestroy: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_create_window_function(
        db: *mut sqlite3,
        zFunctionName: *const ::core::ffi::c_char,
        nArg: ::core::ffi::c_int,
        eTextRep: ::core::ffi::c_int,
        pApp: *mut ::core::ffi::c_void,
        xStep: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut sqlite3_context,
                arg2: ::core::ffi::c_int,
                arg3: *mut *mut sqlite3_value,
            ),
        >,
        xFinal: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_context)>,
        xValue: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_context)>,
        xInverse: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut sqlite3_context,
                arg2: ::core::ffi::c_int,
                arg3: *mut *mut sqlite3_value,
            ),
        >,
        xDestroy: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_aggregate_count(arg1: *mut sqlite3_context) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_expired(arg1: *mut sqlite3_stmt) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_transfer_bindings(
        arg1: *mut sqlite3_stmt,
        arg2: *mut sqlite3_stmt,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_global_recover() -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_thread_cleanup();
}
extern "C" {
    pub fn sqlite3_memory_alarm(
        arg1: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: sqlite3_int64,
                arg3: ::core::ffi::c_int,
            ),
        >,
        arg2: *mut ::core::ffi::c_void,
        arg3: sqlite3_int64,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_value_blob(arg1: *mut sqlite3_value) -> *const ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_value_double(arg1: *mut sqlite3_value) -> f64;
}
extern "C" {
    pub fn sqlite3_value_int(arg1: *mut sqlite3_value) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_value_int64(arg1: *mut sqlite3_value) -> sqlite3_int64;
}
extern "C" {
    pub fn sqlite3_value_pointer(
        arg1: *mut sqlite3_value,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_value_text(arg1: *mut sqlite3_value) -> *const ::core::ffi::c_uchar;
}
extern "C" {
    pub fn sqlite3_value_text16(arg1: *mut sqlite3_value) -> *const ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_value_text16le(arg1: *mut sqlite3_value) -> *const ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_value_text16be(arg1: *mut sqlite3_value) -> *const ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_value_bytes(arg1: *mut sqlite3_value) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_value_bytes16(arg1: *mut sqlite3_value) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_value_type(arg1: *mut sqlite3_value) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_value_numeric_type(arg1: *mut sqlite3_value) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_value_nochange(arg1: *mut sqlite3_value) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_value_frombind(arg1: *mut sqlite3_value) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_value_encoding(arg1: *mut sqlite3_value) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_value_subtype(arg1: *mut sqlite3_value) -> ::core::ffi::c_uint;
}
extern "C" {
    pub fn sqlite3_value_dup(arg1: *const sqlite3_value) -> *mut sqlite3_value;
}
extern "C" {
    pub fn sqlite3_value_free(arg1: *mut sqlite3_value);
}
extern "C" {
    pub fn sqlite3_aggregate_context(
        arg1: *mut sqlite3_context,
        nBytes: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_user_data(arg1: *mut sqlite3_context) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_context_db_handle(arg1: *mut sqlite3_context) -> *mut sqlite3;
}
extern "C" {
    pub fn sqlite3_get_auxdata(
        arg1: *mut sqlite3_context,
        N: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_set_auxdata(
        arg1: *mut sqlite3_context,
        N: ::core::ffi::c_int,
        arg2: *mut ::core::ffi::c_void,
        arg3: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    );
}
extern "C" {
    pub fn sqlite3_get_clientdata(
        arg1: *mut sqlite3,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_set_clientdata(
        arg1: *mut sqlite3,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut ::core::ffi::c_void,
        arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
pub type sqlite3_destructor_type =
    ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>;
extern "C" {
    pub fn sqlite3_result_blob(
        arg1: *mut sqlite3_context,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_int,
        arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    );
}
extern "C" {
    pub fn sqlite3_result_blob64(
        arg1: *mut sqlite3_context,
        arg2: *const ::core::ffi::c_void,
        arg3: sqlite3_uint64,
        arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    );
}
extern "C" {
    pub fn sqlite3_result_double(arg1: *mut sqlite3_context, arg2: f64);
}
extern "C" {
    pub fn sqlite3_result_error(
        arg1: *mut sqlite3_context,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
    );
}
extern "C" {
    pub fn sqlite3_result_error16(
        arg1: *mut sqlite3_context,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_int,
    );
}
extern "C" {
    pub fn sqlite3_result_error_toobig(arg1: *mut sqlite3_context);
}
extern "C" {
    pub fn sqlite3_result_error_nomem(arg1: *mut sqlite3_context);
}
extern "C" {
    pub fn sqlite3_result_error_code(arg1: *mut sqlite3_context, arg2: ::core::ffi::c_int);
}
extern "C" {
    pub fn sqlite3_result_int(arg1: *mut sqlite3_context, arg2: ::core::ffi::c_int);
}
extern "C" {
    pub fn sqlite3_result_int64(arg1: *mut sqlite3_context, arg2: sqlite3_int64);
}
extern "C" {
    pub fn sqlite3_result_null(arg1: *mut sqlite3_context);
}
extern "C" {
    pub fn sqlite3_result_text(
        arg1: *mut sqlite3_context,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
        arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    );
}
extern "C" {
    pub fn sqlite3_result_text64(
        arg1: *mut sqlite3_context,
        arg2: *const ::core::ffi::c_char,
        arg3: sqlite3_uint64,
        arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        encoding: ::core::ffi::c_uchar,
    );
}
extern "C" {
    pub fn sqlite3_result_text16(
        arg1: *mut sqlite3_context,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_int,
        arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    );
}
extern "C" {
    pub fn sqlite3_result_text16le(
        arg1: *mut sqlite3_context,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_int,
        arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    );
}
extern "C" {
    pub fn sqlite3_result_text16be(
        arg1: *mut sqlite3_context,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_int,
        arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    );
}
extern "C" {
    pub fn sqlite3_result_value(arg1: *mut sqlite3_context, arg2: *mut sqlite3_value);
}
extern "C" {
    pub fn sqlite3_result_pointer(
        arg1: *mut sqlite3_context,
        arg2: *mut ::core::ffi::c_void,
        arg3: *const ::core::ffi::c_char,
        arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    );
}
extern "C" {
    pub fn sqlite3_result_zeroblob(arg1: *mut sqlite3_context, n: ::core::ffi::c_int);
}
extern "C" {
    pub fn sqlite3_result_zeroblob64(
        arg1: *mut sqlite3_context,
        n: sqlite3_uint64,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_result_subtype(arg1: *mut sqlite3_context, arg2: ::core::ffi::c_uint);
}
extern "C" {
    pub fn sqlite3_create_collation(
        arg1: *mut sqlite3,
        zName: *const ::core::ffi::c_char,
        eTextRep: ::core::ffi::c_int,
        pArg: *mut ::core::ffi::c_void,
        xCompare: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: ::core::ffi::c_int,
                arg3: *const ::core::ffi::c_void,
                arg4: ::core::ffi::c_int,
                arg5: *const ::core::ffi::c_void,
            ) -> ::core::ffi::c_int,
        >,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_create_collation_v2(
        arg1: *mut sqlite3,
        zName: *const ::core::ffi::c_char,
        eTextRep: ::core::ffi::c_int,
        pArg: *mut ::core::ffi::c_void,
        xCompare: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: ::core::ffi::c_int,
                arg3: *const ::core::ffi::c_void,
                arg4: ::core::ffi::c_int,
                arg5: *const ::core::ffi::c_void,
            ) -> ::core::ffi::c_int,
        >,
        xDestroy: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_create_collation16(
        arg1: *mut sqlite3,
        zName: *const ::core::ffi::c_void,
        eTextRep: ::core::ffi::c_int,
        pArg: *mut ::core::ffi::c_void,
        xCompare: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: ::core::ffi::c_int,
                arg3: *const ::core::ffi::c_void,
                arg4: ::core::ffi::c_int,
                arg5: *const ::core::ffi::c_void,
            ) -> ::core::ffi::c_int,
        >,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_collation_needed(
        arg1: *mut sqlite3,
        arg2: *mut ::core::ffi::c_void,
        arg3: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: *mut sqlite3,
                eTextRep: ::core::ffi::c_int,
                arg3: *const ::core::ffi::c_char,
            ),
        >,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_collation_needed16(
        arg1: *mut sqlite3,
        arg2: *mut ::core::ffi::c_void,
        arg3: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: *mut sqlite3,
                eTextRep: ::core::ffi::c_int,
                arg3: *const ::core::ffi::c_void,
            ),
        >,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_sleep(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
extern "C" {
    pub static mut sqlite3_temp_directory: *mut ::core::ffi::c_char;
}
extern "C" {
    pub static mut sqlite3_data_directory: *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_win32_set_directory(
        type_: ::core::ffi::c_ulong,
        zValue: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_win32_set_directory8(
        type_: ::core::ffi::c_ulong,
        zValue: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_win32_set_directory16(
        type_: ::core::ffi::c_ulong,
        zValue: *const ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_get_autocommit(arg1: *mut sqlite3) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_db_handle(arg1: *mut sqlite3_stmt) -> *mut sqlite3;
}
extern "C" {
    pub fn sqlite3_db_name(db: *mut sqlite3, N: ::core::ffi::c_int) -> *const ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_db_filename(
        db: *mut sqlite3,
        zDbName: *const ::core::ffi::c_char,
    ) -> sqlite3_filename;
}
extern "C" {
    pub fn sqlite3_db_readonly(
        db: *mut sqlite3,
        zDbName: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_txn_state(
        arg1: *mut sqlite3,
        zSchema: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_next_stmt(pDb: *mut sqlite3, pStmt: *mut sqlite3_stmt) -> *mut sqlite3_stmt;
}
extern "C" {
    pub fn sqlite3_commit_hook(
        arg1: *mut sqlite3,
        arg2: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
        >,
        arg3: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_rollback_hook(
        arg1: *mut sqlite3,
        arg2: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        arg3: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_autovacuum_pages(
        db: *mut sqlite3,
        arg1: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: *const ::core::ffi::c_char,
                arg3: ::core::ffi::c_uint,
                arg4: ::core::ffi::c_uint,
                arg5: ::core::ffi::c_uint,
            ) -> ::core::ffi::c_uint,
        >,
        arg2: *mut ::core::ffi::c_void,
        arg3: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_update_hook(
        arg1: *mut sqlite3,
        arg2: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: ::core::ffi::c_int,
                arg3: *const ::core::ffi::c_char,
                arg4: *const ::core::ffi::c_char,
                arg5: sqlite3_int64,
            ),
        >,
        arg3: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_enable_shared_cache(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_release_memory(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_db_release_memory(arg1: *mut sqlite3) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_soft_heap_limit64(N: sqlite3_int64) -> sqlite3_int64;
}
extern "C" {
    pub fn sqlite3_hard_heap_limit64(N: sqlite3_int64) -> sqlite3_int64;
}
extern "C" {
    pub fn sqlite3_soft_heap_limit(N: ::core::ffi::c_int);
}
extern "C" {
    pub fn sqlite3_table_column_metadata(
        db: *mut sqlite3,
        zDbName: *const ::core::ffi::c_char,
        zTableName: *const ::core::ffi::c_char,
        zColumnName: *const ::core::ffi::c_char,
        pzDataType: *mut *const ::core::ffi::c_char,
        pzCollSeq: *mut *const ::core::ffi::c_char,
        pNotNull: *mut ::core::ffi::c_int,
        pPrimaryKey: *mut ::core::ffi::c_int,
        pAutoinc: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_load_extension(
        db: *mut sqlite3,
        zFile: *const ::core::ffi::c_char,
        zProc: *const ::core::ffi::c_char,
        pzErrMsg: *mut *mut ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_enable_load_extension(
        db: *mut sqlite3,
        onoff: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_auto_extension(
        xEntryPoint: ::core::option::Option<unsafe extern "C" fn()>,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_cancel_auto_extension(
        xEntryPoint: ::core::option::Option<unsafe extern "C" fn()>,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_reset_auto_extension();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_module {
    pub iVersion: ::core::ffi::c_int,
    pub xCreate: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            pAux: *mut ::core::ffi::c_void,
            argc: ::core::ffi::c_int,
            argv: *const *const ::core::ffi::c_char,
            ppVTab: *mut *mut sqlite3_vtab,
            arg2: *mut *mut ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub xConnect: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            pAux: *mut ::core::ffi::c_void,
            argc: ::core::ffi::c_int,
            argv: *const *const ::core::ffi::c_char,
            ppVTab: *mut *mut sqlite3_vtab,
            arg2: *mut *mut ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub xBestIndex: ::core::option::Option<
        unsafe extern "C" fn(
            pVTab: *mut sqlite3_vtab,
            arg1: *mut sqlite3_index_info,
        ) -> ::core::ffi::c_int,
    >,
    pub xDisconnect: ::core::option::Option<
        unsafe extern "C" fn(pVTab: *mut sqlite3_vtab) -> ::core::ffi::c_int,
    >,
    pub xDestroy: ::core::option::Option<
        unsafe extern "C" fn(pVTab: *mut sqlite3_vtab) -> ::core::ffi::c_int,
    >,
    pub xOpen: ::core::option::Option<
        unsafe extern "C" fn(
            pVTab: *mut sqlite3_vtab,
            ppCursor: *mut *mut sqlite3_vtab_cursor,
        ) -> ::core::ffi::c_int,
    >,
    pub xClose: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_vtab_cursor) -> ::core::ffi::c_int,
    >,
    pub xFilter: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vtab_cursor,
            idxNum: ::core::ffi::c_int,
            idxStr: *const ::core::ffi::c_char,
            argc: ::core::ffi::c_int,
            argv: *mut *mut sqlite3_value,
        ) -> ::core::ffi::c_int,
    >,
    pub xNext: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_vtab_cursor) -> ::core::ffi::c_int,
    >,
    pub xEof: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_vtab_cursor) -> ::core::ffi::c_int,
    >,
    pub xColumn: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vtab_cursor,
            arg2: *mut sqlite3_context,
            arg3: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xRowid: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vtab_cursor,
            pRowid: *mut sqlite3_int64,
        ) -> ::core::ffi::c_int,
    >,
    pub xUpdate: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vtab,
            arg2: ::core::ffi::c_int,
            arg3: *mut *mut sqlite3_value,
            arg4: *mut sqlite3_int64,
        ) -> ::core::ffi::c_int,
    >,
    pub xBegin: ::core::option::Option<
        unsafe extern "C" fn(pVTab: *mut sqlite3_vtab) -> ::core::ffi::c_int,
    >,
    pub xSync: ::core::option::Option<
        unsafe extern "C" fn(pVTab: *mut sqlite3_vtab) -> ::core::ffi::c_int,
    >,
    pub xCommit: ::core::option::Option<
        unsafe extern "C" fn(pVTab: *mut sqlite3_vtab) -> ::core::ffi::c_int,
    >,
    pub xRollback: ::core::option::Option<
        unsafe extern "C" fn(pVTab: *mut sqlite3_vtab) -> ::core::ffi::c_int,
    >,
    pub xFindFunction: ::core::option::Option<
        unsafe extern "C" fn(
            pVtab: *mut sqlite3_vtab,
            nArg: ::core::ffi::c_int,
            zName: *const ::core::ffi::c_char,
            pxFunc: *mut ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *mut sqlite3_context,
                    arg2: ::core::ffi::c_int,
                    arg3: *mut *mut sqlite3_value,
                ),
            >,
            ppArg: *mut *mut ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
    pub xRename: ::core::option::Option<
        unsafe extern "C" fn(
            pVtab: *mut sqlite3_vtab,
            zNew: *const ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub xSavepoint: ::core::option::Option<
        unsafe extern "C" fn(
            pVTab: *mut sqlite3_vtab,
            arg1: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xRelease: ::core::option::Option<
        unsafe extern "C" fn(
            pVTab: *mut sqlite3_vtab,
            arg1: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xRollbackTo: ::core::option::Option<
        unsafe extern "C" fn(
            pVTab: *mut sqlite3_vtab,
            arg1: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xShadowName: ::core::option::Option<
        unsafe extern "C" fn(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_int,
    >,
    pub xIntegrity: ::core::option::Option<
        unsafe extern "C" fn(
            pVTab: *mut sqlite3_vtab,
            zSchema: *const ::core::ffi::c_char,
            zTabName: *const ::core::ffi::c_char,
            mFlags: ::core::ffi::c_int,
            pzErr: *mut *mut ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
}
#[test]
fn bindgen_test_layout_sqlite3_module() {
    const UNINIT: ::core::mem::MaybeUninit<sqlite3_module> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sqlite3_module>(),
        100usize,
        concat!("Size of: ", stringify!(sqlite3_module))
    );
    assert_eq!(
        ::core::mem::align_of::<sqlite3_module>(),
        4usize,
        concat!("Alignment of ", stringify!(sqlite3_module))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_module),
            "::",
            stringify!(iVersion)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xCreate) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_module),
            "::",
            stringify!(xCreate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xConnect) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_module),
            "::",
            stringify!(xConnect)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xBestIndex) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_module),
            "::",
            stringify!(xBestIndex)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xDisconnect) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_module),
            "::",
            stringify!(xDisconnect)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xDestroy) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_module),
            "::",
            stringify!(xDestroy)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xOpen) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_module),
            "::",
            stringify!(xOpen)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xClose) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_module),
            "::",
            stringify!(xClose)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xFilter) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_module),
            "::",
            stringify!(xFilter)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xNext) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_module),
            "::",
            stringify!(xNext)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xEof) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_module),
            "::",
            stringify!(xEof)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xColumn) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_module),
            "::",
            stringify!(xColumn)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xRowid) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_module),
            "::",
            stringify!(xRowid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xUpdate) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_module),
            "::",
            stringify!(xUpdate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xBegin) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_module),
            "::",
            stringify!(xBegin)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xSync) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_module),
            "::",
            stringify!(xSync)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xCommit) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_module),
            "::",
            stringify!(xCommit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xRollback) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_module),
            "::",
            stringify!(xRollback)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xFindFunction) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_module),
            "::",
            stringify!(xFindFunction)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xRename) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_module),
            "::",
            stringify!(xRename)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xSavepoint) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_module),
            "::",
            stringify!(xSavepoint)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xRelease) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_module),
            "::",
            stringify!(xRelease)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xRollbackTo) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_module),
            "::",
            stringify!(xRollbackTo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xShadowName) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_module),
            "::",
            stringify!(xShadowName)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xIntegrity) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_module),
            "::",
            stringify!(xIntegrity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_index_info {
    pub nConstraint: ::core::ffi::c_int,
    pub aConstraint: *mut sqlite3_index_info_sqlite3_index_constraint,
    pub nOrderBy: ::core::ffi::c_int,
    pub aOrderBy: *mut sqlite3_index_info_sqlite3_index_orderby,
    pub aConstraintUsage: *mut sqlite3_index_info_sqlite3_index_constraint_usage,
    pub idxNum: ::core::ffi::c_int,
    pub idxStr: *mut ::core::ffi::c_char,
    pub needToFreeIdxStr: ::core::ffi::c_int,
    pub orderByConsumed: ::core::ffi::c_int,
    pub estimatedCost: f64,
    pub estimatedRows: sqlite3_int64,
    pub idxFlags: ::core::ffi::c_int,
    pub colUsed: sqlite3_uint64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_index_info_sqlite3_index_constraint {
    pub iColumn: ::core::ffi::c_int,
    pub op: ::core::ffi::c_uchar,
    pub usable: ::core::ffi::c_uchar,
    pub iTermOffset: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_sqlite3_index_info_sqlite3_index_constraint() {
    const UNINIT: ::core::mem::MaybeUninit<sqlite3_index_info_sqlite3_index_constraint> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sqlite3_index_info_sqlite3_index_constraint>(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(sqlite3_index_info_sqlite3_index_constraint)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sqlite3_index_info_sqlite3_index_constraint>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(sqlite3_index_info_sqlite3_index_constraint)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iColumn) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_index_info_sqlite3_index_constraint),
            "::",
            stringify!(iColumn)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).op) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_index_info_sqlite3_index_constraint),
            "::",
            stringify!(op)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).usable) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_index_info_sqlite3_index_constraint),
            "::",
            stringify!(usable)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iTermOffset) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_index_info_sqlite3_index_constraint),
            "::",
            stringify!(iTermOffset)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_index_info_sqlite3_index_orderby {
    pub iColumn: ::core::ffi::c_int,
    pub desc: ::core::ffi::c_uchar,
}
#[test]
fn bindgen_test_layout_sqlite3_index_info_sqlite3_index_orderby() {
    const UNINIT: ::core::mem::MaybeUninit<sqlite3_index_info_sqlite3_index_orderby> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sqlite3_index_info_sqlite3_index_orderby>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(sqlite3_index_info_sqlite3_index_orderby)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sqlite3_index_info_sqlite3_index_orderby>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(sqlite3_index_info_sqlite3_index_orderby)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iColumn) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_index_info_sqlite3_index_orderby),
            "::",
            stringify!(iColumn)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).desc) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_index_info_sqlite3_index_orderby),
            "::",
            stringify!(desc)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_index_info_sqlite3_index_constraint_usage {
    pub argvIndex: ::core::ffi::c_int,
    pub omit: ::core::ffi::c_uchar,
}
#[test]
fn bindgen_test_layout_sqlite3_index_info_sqlite3_index_constraint_usage() {
    const UNINIT: ::core::mem::MaybeUninit<sqlite3_index_info_sqlite3_index_constraint_usage> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sqlite3_index_info_sqlite3_index_constraint_usage>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(sqlite3_index_info_sqlite3_index_constraint_usage)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<sqlite3_index_info_sqlite3_index_constraint_usage>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(sqlite3_index_info_sqlite3_index_constraint_usage)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).argvIndex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_index_info_sqlite3_index_constraint_usage),
            "::",
            stringify!(argvIndex)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).omit) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_index_info_sqlite3_index_constraint_usage),
            "::",
            stringify!(omit)
        )
    );
}
#[test]
fn bindgen_test_layout_sqlite3_index_info() {
    const UNINIT: ::core::mem::MaybeUninit<sqlite3_index_info> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sqlite3_index_info>(),
        72usize,
        concat!("Size of: ", stringify!(sqlite3_index_info))
    );
    assert_eq!(
        ::core::mem::align_of::<sqlite3_index_info>(),
        8usize,
        concat!("Alignment of ", stringify!(sqlite3_index_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nConstraint) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_index_info),
            "::",
            stringify!(nConstraint)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).aConstraint) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_index_info),
            "::",
            stringify!(aConstraint)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nOrderBy) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_index_info),
            "::",
            stringify!(nOrderBy)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).aOrderBy) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_index_info),
            "::",
            stringify!(aOrderBy)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).aConstraintUsage) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_index_info),
            "::",
            stringify!(aConstraintUsage)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).idxNum) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_index_info),
            "::",
            stringify!(idxNum)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).idxStr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_index_info),
            "::",
            stringify!(idxStr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).needToFreeIdxStr) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_index_info),
            "::",
            stringify!(needToFreeIdxStr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).orderByConsumed) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_index_info),
            "::",
            stringify!(orderByConsumed)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).estimatedCost) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_index_info),
            "::",
            stringify!(estimatedCost)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).estimatedRows) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_index_info),
            "::",
            stringify!(estimatedRows)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).idxFlags) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_index_info),
            "::",
            stringify!(idxFlags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).colUsed) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_index_info),
            "::",
            stringify!(colUsed)
        )
    );
}
extern "C" {
    pub fn sqlite3_create_module(
        db: *mut sqlite3,
        zName: *const ::core::ffi::c_char,
        p: *const sqlite3_module,
        pClientData: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_create_module_v2(
        db: *mut sqlite3,
        zName: *const ::core::ffi::c_char,
        p: *const sqlite3_module,
        pClientData: *mut ::core::ffi::c_void,
        xDestroy: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_drop_modules(
        db: *mut sqlite3,
        azKeep: *mut *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_vtab {
    pub pModule: *const sqlite3_module,
    pub nRef: ::core::ffi::c_int,
    pub zErrMsg: *mut ::core::ffi::c_char,
}
#[test]
fn bindgen_test_layout_sqlite3_vtab() {
    const UNINIT: ::core::mem::MaybeUninit<sqlite3_vtab> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sqlite3_vtab>(),
        12usize,
        concat!("Size of: ", stringify!(sqlite3_vtab))
    );
    assert_eq!(
        ::core::mem::align_of::<sqlite3_vtab>(),
        4usize,
        concat!("Alignment of ", stringify!(sqlite3_vtab))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pModule) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vtab),
            "::",
            stringify!(pModule)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nRef) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vtab),
            "::",
            stringify!(nRef)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).zErrMsg) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vtab),
            "::",
            stringify!(zErrMsg)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_vtab_cursor {
    pub pVtab: *mut sqlite3_vtab,
}
#[test]
fn bindgen_test_layout_sqlite3_vtab_cursor() {
    const UNINIT: ::core::mem::MaybeUninit<sqlite3_vtab_cursor> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sqlite3_vtab_cursor>(),
        4usize,
        concat!("Size of: ", stringify!(sqlite3_vtab_cursor))
    );
    assert_eq!(
        ::core::mem::align_of::<sqlite3_vtab_cursor>(),
        4usize,
        concat!("Alignment of ", stringify!(sqlite3_vtab_cursor))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pVtab) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_vtab_cursor),
            "::",
            stringify!(pVtab)
        )
    );
}
extern "C" {
    pub fn sqlite3_declare_vtab(
        arg1: *mut sqlite3,
        zSQL: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_overload_function(
        arg1: *mut sqlite3,
        zFuncName: *const ::core::ffi::c_char,
        nArg: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_blob {
    _unused: [u8; 0],
}
extern "C" {
    pub fn sqlite3_blob_open(
        arg1: *mut sqlite3,
        zDb: *const ::core::ffi::c_char,
        zTable: *const ::core::ffi::c_char,
        zColumn: *const ::core::ffi::c_char,
        iRow: sqlite3_int64,
        flags: ::core::ffi::c_int,
        ppBlob: *mut *mut sqlite3_blob,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_blob_reopen(arg1: *mut sqlite3_blob, arg2: sqlite3_int64) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_blob_close(arg1: *mut sqlite3_blob) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_blob_bytes(arg1: *mut sqlite3_blob) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_blob_read(
        arg1: *mut sqlite3_blob,
        Z: *mut ::core::ffi::c_void,
        N: ::core::ffi::c_int,
        iOffset: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_blob_write(
        arg1: *mut sqlite3_blob,
        z: *const ::core::ffi::c_void,
        n: ::core::ffi::c_int,
        iOffset: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_vfs_find(zVfsName: *const ::core::ffi::c_char) -> *mut sqlite3_vfs;
}
extern "C" {
    pub fn sqlite3_vfs_register(
        arg1: *mut sqlite3_vfs,
        makeDflt: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_vfs_unregister(arg1: *mut sqlite3_vfs) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_mutex_alloc(arg1: ::core::ffi::c_int) -> *mut sqlite3_mutex;
}
extern "C" {
    pub fn sqlite3_mutex_free(arg1: *mut sqlite3_mutex);
}
extern "C" {
    pub fn sqlite3_mutex_enter(arg1: *mut sqlite3_mutex);
}
extern "C" {
    pub fn sqlite3_mutex_try(arg1: *mut sqlite3_mutex) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_mutex_leave(arg1: *mut sqlite3_mutex);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_mutex_methods {
    pub xMutexInit: ::core::option::Option<unsafe extern "C" fn() -> ::core::ffi::c_int>,
    pub xMutexEnd: ::core::option::Option<unsafe extern "C" fn() -> ::core::ffi::c_int>,
    pub xMutexAlloc: ::core::option::Option<
        unsafe extern "C" fn(arg1: ::core::ffi::c_int) -> *mut sqlite3_mutex,
    >,
    pub xMutexFree: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_mutex)>,
    pub xMutexEnter: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_mutex)>,
    pub xMutexTry: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_mutex) -> ::core::ffi::c_int,
    >,
    pub xMutexLeave: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_mutex)>,
    pub xMutexHeld: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_mutex) -> ::core::ffi::c_int,
    >,
    pub xMutexNotheld: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_mutex) -> ::core::ffi::c_int,
    >,
}
#[test]
fn bindgen_test_layout_sqlite3_mutex_methods() {
    const UNINIT: ::core::mem::MaybeUninit<sqlite3_mutex_methods> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sqlite3_mutex_methods>(),
        36usize,
        concat!("Size of: ", stringify!(sqlite3_mutex_methods))
    );
    assert_eq!(
        ::core::mem::align_of::<sqlite3_mutex_methods>(),
        4usize,
        concat!("Alignment of ", stringify!(sqlite3_mutex_methods))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xMutexInit) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_mutex_methods),
            "::",
            stringify!(xMutexInit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xMutexEnd) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_mutex_methods),
            "::",
            stringify!(xMutexEnd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xMutexAlloc) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_mutex_methods),
            "::",
            stringify!(xMutexAlloc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xMutexFree) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_mutex_methods),
            "::",
            stringify!(xMutexFree)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xMutexEnter) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_mutex_methods),
            "::",
            stringify!(xMutexEnter)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xMutexTry) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_mutex_methods),
            "::",
            stringify!(xMutexTry)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xMutexLeave) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_mutex_methods),
            "::",
            stringify!(xMutexLeave)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xMutexHeld) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_mutex_methods),
            "::",
            stringify!(xMutexHeld)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xMutexNotheld) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_mutex_methods),
            "::",
            stringify!(xMutexNotheld)
        )
    );
}
extern "C" {
    pub fn sqlite3_mutex_held(arg1: *mut sqlite3_mutex) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_mutex_notheld(arg1: *mut sqlite3_mutex) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_db_mutex(arg1: *mut sqlite3) -> *mut sqlite3_mutex;
}
extern "C" {
    pub fn sqlite3_file_control(
        arg1: *mut sqlite3,
        zDbName: *const ::core::ffi::c_char,
        op: ::core::ffi::c_int,
        arg2: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_test_control(op: ::core::ffi::c_int, ...) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_keyword_count() -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_keyword_name(
        arg1: ::core::ffi::c_int,
        arg2: *mut *const ::core::ffi::c_char,
        arg3: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_keyword_check(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_str {
    _unused: [u8; 0],
}
extern "C" {
    pub fn sqlite3_str_new(arg1: *mut sqlite3) -> *mut sqlite3_str;
}
extern "C" {
    pub fn sqlite3_str_finish(arg1: *mut sqlite3_str) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_str_appendf(arg1: *mut sqlite3_str, zFormat: *const ::core::ffi::c_char, ...);
}
extern "C" {
    pub fn sqlite3_str_vappendf(
        arg1: *mut sqlite3_str,
        zFormat: *const ::core::ffi::c_char,
        arg2: va_list,
    );
}
extern "C" {
    pub fn sqlite3_str_append(
        arg1: *mut sqlite3_str,
        zIn: *const ::core::ffi::c_char,
        N: ::core::ffi::c_int,
    );
}
extern "C" {
    pub fn sqlite3_str_appendall(arg1: *mut sqlite3_str, zIn: *const ::core::ffi::c_char);
}
extern "C" {
    pub fn sqlite3_str_appendchar(
        arg1: *mut sqlite3_str,
        N: ::core::ffi::c_int,
        C: ::core::ffi::c_char,
    );
}
extern "C" {
    pub fn sqlite3_str_reset(arg1: *mut sqlite3_str);
}
extern "C" {
    pub fn sqlite3_str_errcode(arg1: *mut sqlite3_str) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_str_length(arg1: *mut sqlite3_str) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_str_value(arg1: *mut sqlite3_str) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_status(
        op: ::core::ffi::c_int,
        pCurrent: *mut ::core::ffi::c_int,
        pHighwater: *mut ::core::ffi::c_int,
        resetFlag: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_status64(
        op: ::core::ffi::c_int,
        pCurrent: *mut sqlite3_int64,
        pHighwater: *mut sqlite3_int64,
        resetFlag: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_db_status(
        arg1: *mut sqlite3,
        op: ::core::ffi::c_int,
        pCur: *mut ::core::ffi::c_int,
        pHiwtr: *mut ::core::ffi::c_int,
        resetFlg: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_stmt_status(
        arg1: *mut sqlite3_stmt,
        op: ::core::ffi::c_int,
        resetFlg: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_pcache {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_pcache_page {
    pub pBuf: *mut ::core::ffi::c_void,
    pub pExtra: *mut ::core::ffi::c_void,
}
#[test]
fn bindgen_test_layout_sqlite3_pcache_page() {
    const UNINIT: ::core::mem::MaybeUninit<sqlite3_pcache_page> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sqlite3_pcache_page>(),
        8usize,
        concat!("Size of: ", stringify!(sqlite3_pcache_page))
    );
    assert_eq!(
        ::core::mem::align_of::<sqlite3_pcache_page>(),
        4usize,
        concat!("Alignment of ", stringify!(sqlite3_pcache_page))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pBuf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_page),
            "::",
            stringify!(pBuf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pExtra) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_page),
            "::",
            stringify!(pExtra)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_pcache_methods2 {
    pub iVersion: ::core::ffi::c_int,
    pub pArg: *mut ::core::ffi::c_void,
    pub xInit: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
    >,
    pub xShutdown: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    pub xCreate: ::core::option::Option<
        unsafe extern "C" fn(
            szPage: ::core::ffi::c_int,
            szExtra: ::core::ffi::c_int,
            bPurgeable: ::core::ffi::c_int,
        ) -> *mut sqlite3_pcache,
    >,
    pub xCachesize: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_pcache, nCachesize: ::core::ffi::c_int),
    >,
    pub xPagecount: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_pcache) -> ::core::ffi::c_int,
    >,
    pub xFetch: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_pcache,
            key: ::core::ffi::c_uint,
            createFlag: ::core::ffi::c_int,
        ) -> *mut sqlite3_pcache_page,
    >,
    pub xUnpin: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_pcache,
            arg2: *mut sqlite3_pcache_page,
            discard: ::core::ffi::c_int,
        ),
    >,
    pub xRekey: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_pcache,
            arg2: *mut sqlite3_pcache_page,
            oldKey: ::core::ffi::c_uint,
            newKey: ::core::ffi::c_uint,
        ),
    >,
    pub xTruncate: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_pcache, iLimit: ::core::ffi::c_uint),
    >,
    pub xDestroy: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_pcache)>,
    pub xShrink: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_pcache)>,
}
#[test]
fn bindgen_test_layout_sqlite3_pcache_methods2() {
    const UNINIT: ::core::mem::MaybeUninit<sqlite3_pcache_methods2> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sqlite3_pcache_methods2>(),
        52usize,
        concat!("Size of: ", stringify!(sqlite3_pcache_methods2))
    );
    assert_eq!(
        ::core::mem::align_of::<sqlite3_pcache_methods2>(),
        4usize,
        concat!("Alignment of ", stringify!(sqlite3_pcache_methods2))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_methods2),
            "::",
            stringify!(iVersion)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pArg) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_methods2),
            "::",
            stringify!(pArg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xInit) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_methods2),
            "::",
            stringify!(xInit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xShutdown) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_methods2),
            "::",
            stringify!(xShutdown)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xCreate) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_methods2),
            "::",
            stringify!(xCreate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xCachesize) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_methods2),
            "::",
            stringify!(xCachesize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xPagecount) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_methods2),
            "::",
            stringify!(xPagecount)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xFetch) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_methods2),
            "::",
            stringify!(xFetch)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xUnpin) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_methods2),
            "::",
            stringify!(xUnpin)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xRekey) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_methods2),
            "::",
            stringify!(xRekey)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xTruncate) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_methods2),
            "::",
            stringify!(xTruncate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xDestroy) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_methods2),
            "::",
            stringify!(xDestroy)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xShrink) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_methods2),
            "::",
            stringify!(xShrink)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_pcache_methods {
    pub pArg: *mut ::core::ffi::c_void,
    pub xInit: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
    >,
    pub xShutdown: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    pub xCreate: ::core::option::Option<
        unsafe extern "C" fn(
            szPage: ::core::ffi::c_int,
            bPurgeable: ::core::ffi::c_int,
        ) -> *mut sqlite3_pcache,
    >,
    pub xCachesize: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_pcache, nCachesize: ::core::ffi::c_int),
    >,
    pub xPagecount: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_pcache) -> ::core::ffi::c_int,
    >,
    pub xFetch: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_pcache,
            key: ::core::ffi::c_uint,
            createFlag: ::core::ffi::c_int,
        ) -> *mut ::core::ffi::c_void,
    >,
    pub xUnpin: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_pcache,
            arg2: *mut ::core::ffi::c_void,
            discard: ::core::ffi::c_int,
        ),
    >,
    pub xRekey: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_pcache,
            arg2: *mut ::core::ffi::c_void,
            oldKey: ::core::ffi::c_uint,
            newKey: ::core::ffi::c_uint,
        ),
    >,
    pub xTruncate: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_pcache, iLimit: ::core::ffi::c_uint),
    >,
    pub xDestroy: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_pcache)>,
}
#[test]
fn bindgen_test_layout_sqlite3_pcache_methods() {
    const UNINIT: ::core::mem::MaybeUninit<sqlite3_pcache_methods> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sqlite3_pcache_methods>(),
        44usize,
        concat!("Size of: ", stringify!(sqlite3_pcache_methods))
    );
    assert_eq!(
        ::core::mem::align_of::<sqlite3_pcache_methods>(),
        4usize,
        concat!("Alignment of ", stringify!(sqlite3_pcache_methods))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pArg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_methods),
            "::",
            stringify!(pArg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xInit) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_methods),
            "::",
            stringify!(xInit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xShutdown) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_methods),
            "::",
            stringify!(xShutdown)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xCreate) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_methods),
            "::",
            stringify!(xCreate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xCachesize) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_methods),
            "::",
            stringify!(xCachesize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xPagecount) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_methods),
            "::",
            stringify!(xPagecount)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xFetch) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_methods),
            "::",
            stringify!(xFetch)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xUnpin) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_methods),
            "::",
            stringify!(xUnpin)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xRekey) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_methods),
            "::",
            stringify!(xRekey)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xTruncate) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_methods),
            "::",
            stringify!(xTruncate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xDestroy) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_pcache_methods),
            "::",
            stringify!(xDestroy)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_backup {
    _unused: [u8; 0],
}
extern "C" {
    pub fn sqlite3_backup_init(
        pDest: *mut sqlite3,
        zDestName: *const ::core::ffi::c_char,
        pSource: *mut sqlite3,
        zSourceName: *const ::core::ffi::c_char,
    ) -> *mut sqlite3_backup;
}
extern "C" {
    pub fn sqlite3_backup_step(
        p: *mut sqlite3_backup,
        nPage: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_backup_finish(p: *mut sqlite3_backup) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_backup_remaining(p: *mut sqlite3_backup) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_backup_pagecount(p: *mut sqlite3_backup) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_unlock_notify(
        pBlocked: *mut sqlite3,
        xNotify: ::core::option::Option<
            unsafe extern "C" fn(apArg: *mut *mut ::core::ffi::c_void, nArg: ::core::ffi::c_int),
        >,
        pNotifyArg: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_stricmp(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_strnicmp(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_strglob(
        zGlob: *const ::core::ffi::c_char,
        zStr: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_strlike(
        zGlob: *const ::core::ffi::c_char,
        zStr: *const ::core::ffi::c_char,
        cEsc: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_log(iErrCode: ::core::ffi::c_int, zFormat: *const ::core::ffi::c_char, ...);
}
extern "C" {
    pub fn sqlite3_wal_hook(
        arg1: *mut sqlite3,
        arg2: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut ::core::ffi::c_void,
                arg2: *mut sqlite3,
                arg3: *const ::core::ffi::c_char,
                arg4: ::core::ffi::c_int,
            ) -> ::core::ffi::c_int,
        >,
        arg3: *mut ::core::ffi::c_void,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn sqlite3_wal_autocheckpoint(
        db: *mut sqlite3,
        N: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_wal_checkpoint(
        db: *mut sqlite3,
        zDb: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_wal_checkpoint_v2(
        db: *mut sqlite3,
        zDb: *const ::core::ffi::c_char,
        eMode: ::core::ffi::c_int,
        pnLog: *mut ::core::ffi::c_int,
        pnCkpt: *mut ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_vtab_config(
        arg1: *mut sqlite3,
        op: ::core::ffi::c_int,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_vtab_on_conflict(arg1: *mut sqlite3) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_vtab_nochange(arg1: *mut sqlite3_context) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_vtab_collation(
        arg1: *mut sqlite3_index_info,
        arg2: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
extern "C" {
    pub fn sqlite3_vtab_distinct(arg1: *mut sqlite3_index_info) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_vtab_in(
        arg1: *mut sqlite3_index_info,
        iCons: ::core::ffi::c_int,
        bHandle: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_vtab_in_first(
        pVal: *mut sqlite3_value,
        ppOut: *mut *mut sqlite3_value,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_vtab_in_next(
        pVal: *mut sqlite3_value,
        ppOut: *mut *mut sqlite3_value,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_vtab_rhs_value(
        arg1: *mut sqlite3_index_info,
        arg2: ::core::ffi::c_int,
        ppVal: *mut *mut sqlite3_value,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_stmt_scanstatus(
        pStmt: *mut sqlite3_stmt,
        idx: ::core::ffi::c_int,
        iScanStatusOp: ::core::ffi::c_int,
        pOut: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_stmt_scanstatus_v2(
        pStmt: *mut sqlite3_stmt,
        idx: ::core::ffi::c_int,
        iScanStatusOp: ::core::ffi::c_int,
        flags: ::core::ffi::c_int,
        pOut: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_stmt_scanstatus_reset(arg1: *mut sqlite3_stmt);
}
extern "C" {
    pub fn sqlite3_db_cacheflush(arg1: *mut sqlite3) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_system_errno(arg1: *mut sqlite3) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_snapshot {
    pub hidden: [::core::ffi::c_uchar; 48usize],
}
#[test]
fn bindgen_test_layout_sqlite3_snapshot() {
    const UNINIT: ::core::mem::MaybeUninit<sqlite3_snapshot> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sqlite3_snapshot>(),
        48usize,
        concat!("Size of: ", stringify!(sqlite3_snapshot))
    );
    assert_eq!(
        ::core::mem::align_of::<sqlite3_snapshot>(),
        1usize,
        concat!("Alignment of ", stringify!(sqlite3_snapshot))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hidden) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_snapshot),
            "::",
            stringify!(hidden)
        )
    );
}
extern "C" {
    pub fn sqlite3_snapshot_get(
        db: *mut sqlite3,
        zSchema: *const ::core::ffi::c_char,
        ppSnapshot: *mut *mut sqlite3_snapshot,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_snapshot_open(
        db: *mut sqlite3,
        zSchema: *const ::core::ffi::c_char,
        pSnapshot: *mut sqlite3_snapshot,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_snapshot_free(arg1: *mut sqlite3_snapshot);
}
extern "C" {
    pub fn sqlite3_snapshot_cmp(
        p1: *mut sqlite3_snapshot,
        p2: *mut sqlite3_snapshot,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_snapshot_recover(
        db: *mut sqlite3,
        zDb: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sqlite3_serialize(
        db: *mut sqlite3,
        zSchema: *const ::core::ffi::c_char,
        piSize: *mut sqlite3_int64,
        mFlags: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_uchar;
}
extern "C" {
    pub fn sqlite3_deserialize(
        db: *mut sqlite3,
        zSchema: *const ::core::ffi::c_char,
        pData: *mut ::core::ffi::c_uchar,
        szDb: sqlite3_int64,
        szBuf: sqlite3_int64,
        mFlags: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
pub type sqlite3_rtree_dbl = f64;
extern "C" {
    pub fn sqlite3_rtree_geometry_callback(
        db: *mut sqlite3,
        zGeom: *const ::core::ffi::c_char,
        xGeom: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut sqlite3_rtree_geometry,
                arg2: ::core::ffi::c_int,
                arg3: *mut sqlite3_rtree_dbl,
                arg4: *mut ::core::ffi::c_int,
            ) -> ::core::ffi::c_int,
        >,
        pContext: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_rtree_geometry {
    pub pContext: *mut ::core::ffi::c_void,
    pub nParam: ::core::ffi::c_int,
    pub aParam: *mut sqlite3_rtree_dbl,
    pub pUser: *mut ::core::ffi::c_void,
    pub xDelUser: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
}
#[test]
fn bindgen_test_layout_sqlite3_rtree_geometry() {
    const UNINIT: ::core::mem::MaybeUninit<sqlite3_rtree_geometry> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sqlite3_rtree_geometry>(),
        20usize,
        concat!("Size of: ", stringify!(sqlite3_rtree_geometry))
    );
    assert_eq!(
        ::core::mem::align_of::<sqlite3_rtree_geometry>(),
        4usize,
        concat!("Alignment of ", stringify!(sqlite3_rtree_geometry))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pContext) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_rtree_geometry),
            "::",
            stringify!(pContext)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nParam) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_rtree_geometry),
            "::",
            stringify!(nParam)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).aParam) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_rtree_geometry),
            "::",
            stringify!(aParam)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pUser) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_rtree_geometry),
            "::",
            stringify!(pUser)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xDelUser) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_rtree_geometry),
            "::",
            stringify!(xDelUser)
        )
    );
}
extern "C" {
    pub fn sqlite3_rtree_query_callback(
        db: *mut sqlite3,
        zQueryFunc: *const ::core::ffi::c_char,
        xQueryFunc: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut sqlite3_rtree_query_info) -> ::core::ffi::c_int,
        >,
        pContext: *mut ::core::ffi::c_void,
        xDestructor: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    ) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_rtree_query_info {
    pub pContext: *mut ::core::ffi::c_void,
    pub nParam: ::core::ffi::c_int,
    pub aParam: *mut sqlite3_rtree_dbl,
    pub pUser: *mut ::core::ffi::c_void,
    pub xDelUser: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    pub aCoord: *mut sqlite3_rtree_dbl,
    pub anQueue: *mut ::core::ffi::c_uint,
    pub nCoord: ::core::ffi::c_int,
    pub iLevel: ::core::ffi::c_int,
    pub mxLevel: ::core::ffi::c_int,
    pub iRowid: sqlite3_int64,
    pub rParentScore: sqlite3_rtree_dbl,
    pub eParentWithin: ::core::ffi::c_int,
    pub eWithin: ::core::ffi::c_int,
    pub rScore: sqlite3_rtree_dbl,
    pub apSqlParam: *mut *mut sqlite3_value,
}
#[test]
fn bindgen_test_layout_sqlite3_rtree_query_info() {
    const UNINIT: ::core::mem::MaybeUninit<sqlite3_rtree_query_info> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sqlite3_rtree_query_info>(),
        80usize,
        concat!("Size of: ", stringify!(sqlite3_rtree_query_info))
    );
    assert_eq!(
        ::core::mem::align_of::<sqlite3_rtree_query_info>(),
        8usize,
        concat!("Alignment of ", stringify!(sqlite3_rtree_query_info))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pContext) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_rtree_query_info),
            "::",
            stringify!(pContext)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nParam) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_rtree_query_info),
            "::",
            stringify!(nParam)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).aParam) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_rtree_query_info),
            "::",
            stringify!(aParam)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pUser) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_rtree_query_info),
            "::",
            stringify!(pUser)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xDelUser) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_rtree_query_info),
            "::",
            stringify!(xDelUser)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).aCoord) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_rtree_query_info),
            "::",
            stringify!(aCoord)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).anQueue) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_rtree_query_info),
            "::",
            stringify!(anQueue)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nCoord) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_rtree_query_info),
            "::",
            stringify!(nCoord)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iLevel) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_rtree_query_info),
            "::",
            stringify!(iLevel)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mxLevel) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_rtree_query_info),
            "::",
            stringify!(mxLevel)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iRowid) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_rtree_query_info),
            "::",
            stringify!(iRowid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rParentScore) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_rtree_query_info),
            "::",
            stringify!(rParentScore)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).eParentWithin) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_rtree_query_info),
            "::",
            stringify!(eParentWithin)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).eWithin) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_rtree_query_info),
            "::",
            stringify!(eWithin)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rScore) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_rtree_query_info),
            "::",
            stringify!(rScore)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).apSqlParam) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_rtree_query_info),
            "::",
            stringify!(apSqlParam)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Fts5Context {
    _unused: [u8; 0],
}
pub type fts5_extension_function = ::core::option::Option<
    unsafe extern "C" fn(
        pApi: *const Fts5ExtensionApi,
        pFts: *mut Fts5Context,
        pCtx: *mut sqlite3_context,
        nVal: ::core::ffi::c_int,
        apVal: *mut *mut sqlite3_value,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Fts5PhraseIter {
    pub a: *const ::core::ffi::c_uchar,
    pub b: *const ::core::ffi::c_uchar,
}
#[test]
fn bindgen_test_layout_Fts5PhraseIter() {
    const UNINIT: ::core::mem::MaybeUninit<Fts5PhraseIter> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<Fts5PhraseIter>(),
        8usize,
        concat!("Size of: ", stringify!(Fts5PhraseIter))
    );
    assert_eq!(
        ::core::mem::align_of::<Fts5PhraseIter>(),
        4usize,
        concat!("Alignment of ", stringify!(Fts5PhraseIter))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).a) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Fts5PhraseIter),
            "::",
            stringify!(a)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Fts5PhraseIter),
            "::",
            stringify!(b)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Fts5ExtensionApi {
    pub iVersion: ::core::ffi::c_int,
    pub xUserData: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut Fts5Context) -> *mut ::core::ffi::c_void,
    >,
    pub xColumnCount:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut Fts5Context) -> ::core::ffi::c_int>,
    pub xRowCount: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            pnRow: *mut sqlite3_int64,
        ) -> ::core::ffi::c_int,
    >,
    pub xColumnTotalSize: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            iCol: ::core::ffi::c_int,
            pnToken: *mut sqlite3_int64,
        ) -> ::core::ffi::c_int,
    >,
    pub xTokenize: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            pText: *const ::core::ffi::c_char,
            nText: ::core::ffi::c_int,
            pCtx: *mut ::core::ffi::c_void,
            xToken: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *mut ::core::ffi::c_void,
                    arg2: ::core::ffi::c_int,
                    arg3: *const ::core::ffi::c_char,
                    arg4: ::core::ffi::c_int,
                    arg5: ::core::ffi::c_int,
                    arg6: ::core::ffi::c_int,
                ) -> ::core::ffi::c_int,
            >,
        ) -> ::core::ffi::c_int,
    >,
    pub xPhraseCount:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut Fts5Context) -> ::core::ffi::c_int>,
    pub xPhraseSize: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            iPhrase: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xInstCount: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            pnInst: *mut ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xInst: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            iIdx: ::core::ffi::c_int,
            piPhrase: *mut ::core::ffi::c_int,
            piCol: *mut ::core::ffi::c_int,
            piOff: *mut ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xRowid:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut Fts5Context) -> sqlite3_int64>,
    pub xColumnText: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            iCol: ::core::ffi::c_int,
            pz: *mut *const ::core::ffi::c_char,
            pn: *mut ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xColumnSize: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            iCol: ::core::ffi::c_int,
            pnToken: *mut ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xQueryPhrase: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            iPhrase: ::core::ffi::c_int,
            pUserData: *mut ::core::ffi::c_void,
            arg2: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *const Fts5ExtensionApi,
                    arg2: *mut Fts5Context,
                    arg3: *mut ::core::ffi::c_void,
                ) -> ::core::ffi::c_int,
            >,
        ) -> ::core::ffi::c_int,
    >,
    pub xSetAuxdata: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            pAux: *mut ::core::ffi::c_void,
            xDelete: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        ) -> ::core::ffi::c_int,
    >,
    pub xGetAuxdata: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            bClear: ::core::ffi::c_int,
        ) -> *mut ::core::ffi::c_void,
    >,
    pub xPhraseFirst: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            iPhrase: ::core::ffi::c_int,
            arg2: *mut Fts5PhraseIter,
            arg3: *mut ::core::ffi::c_int,
            arg4: *mut ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xPhraseNext: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            arg2: *mut Fts5PhraseIter,
            piCol: *mut ::core::ffi::c_int,
            piOff: *mut ::core::ffi::c_int,
        ),
    >,
    pub xPhraseFirstColumn: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            iPhrase: ::core::ffi::c_int,
            arg2: *mut Fts5PhraseIter,
            arg3: *mut ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xPhraseNextColumn: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            arg2: *mut Fts5PhraseIter,
            piCol: *mut ::core::ffi::c_int,
        ),
    >,
    pub xQueryToken: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            iPhrase: ::core::ffi::c_int,
            iToken: ::core::ffi::c_int,
            ppToken: *mut *const ::core::ffi::c_char,
            pnToken: *mut ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub xInstToken: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Context,
            iIdx: ::core::ffi::c_int,
            iToken: ::core::ffi::c_int,
            arg2: *mut *const ::core::ffi::c_char,
            arg3: *mut ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
}
#[test]
fn bindgen_test_layout_Fts5ExtensionApi() {
    const UNINIT: ::core::mem::MaybeUninit<Fts5ExtensionApi> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<Fts5ExtensionApi>(),
        88usize,
        concat!("Size of: ", stringify!(Fts5ExtensionApi))
    );
    assert_eq!(
        ::core::mem::align_of::<Fts5ExtensionApi>(),
        4usize,
        concat!("Alignment of ", stringify!(Fts5ExtensionApi))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Fts5ExtensionApi),
            "::",
            stringify!(iVersion)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xUserData) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Fts5ExtensionApi),
            "::",
            stringify!(xUserData)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xColumnCount) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Fts5ExtensionApi),
            "::",
            stringify!(xColumnCount)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xRowCount) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Fts5ExtensionApi),
            "::",
            stringify!(xRowCount)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xColumnTotalSize) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Fts5ExtensionApi),
            "::",
            stringify!(xColumnTotalSize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xTokenize) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Fts5ExtensionApi),
            "::",
            stringify!(xTokenize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xPhraseCount) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Fts5ExtensionApi),
            "::",
            stringify!(xPhraseCount)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xPhraseSize) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Fts5ExtensionApi),
            "::",
            stringify!(xPhraseSize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xInstCount) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Fts5ExtensionApi),
            "::",
            stringify!(xInstCount)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xInst) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(Fts5ExtensionApi),
            "::",
            stringify!(xInst)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xRowid) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Fts5ExtensionApi),
            "::",
            stringify!(xRowid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xColumnText) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(Fts5ExtensionApi),
            "::",
            stringify!(xColumnText)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xColumnSize) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Fts5ExtensionApi),
            "::",
            stringify!(xColumnSize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xQueryPhrase) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(Fts5ExtensionApi),
            "::",
            stringify!(xQueryPhrase)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xSetAuxdata) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Fts5ExtensionApi),
            "::",
            stringify!(xSetAuxdata)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xGetAuxdata) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(Fts5ExtensionApi),
            "::",
            stringify!(xGetAuxdata)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xPhraseFirst) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(Fts5ExtensionApi),
            "::",
            stringify!(xPhraseFirst)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xPhraseNext) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(Fts5ExtensionApi),
            "::",
            stringify!(xPhraseNext)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xPhraseFirstColumn) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(Fts5ExtensionApi),
            "::",
            stringify!(xPhraseFirstColumn)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xPhraseNextColumn) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(Fts5ExtensionApi),
            "::",
            stringify!(xPhraseNextColumn)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xQueryToken) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(Fts5ExtensionApi),
            "::",
            stringify!(xQueryToken)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xInstToken) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(Fts5ExtensionApi),
            "::",
            stringify!(xInstToken)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Fts5Tokenizer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fts5_tokenizer {
    pub xCreate: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::core::ffi::c_void,
            azArg: *mut *const ::core::ffi::c_char,
            nArg: ::core::ffi::c_int,
            ppOut: *mut *mut Fts5Tokenizer,
        ) -> ::core::ffi::c_int,
    >,
    pub xDelete: ::core::option::Option<unsafe extern "C" fn(arg1: *mut Fts5Tokenizer)>,
    pub xTokenize: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Fts5Tokenizer,
            pCtx: *mut ::core::ffi::c_void,
            flags: ::core::ffi::c_int,
            pText: *const ::core::ffi::c_char,
            nText: ::core::ffi::c_int,
            xToken: ::core::option::Option<
                unsafe extern "C" fn(
                    pCtx: *mut ::core::ffi::c_void,
                    tflags: ::core::ffi::c_int,
                    pToken: *const ::core::ffi::c_char,
                    nToken: ::core::ffi::c_int,
                    iStart: ::core::ffi::c_int,
                    iEnd: ::core::ffi::c_int,
                ) -> ::core::ffi::c_int,
            >,
        ) -> ::core::ffi::c_int,
    >,
}
#[test]
fn bindgen_test_layout_fts5_tokenizer() {
    const UNINIT: ::core::mem::MaybeUninit<fts5_tokenizer> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<fts5_tokenizer>(),
        12usize,
        concat!("Size of: ", stringify!(fts5_tokenizer))
    );
    assert_eq!(
        ::core::mem::align_of::<fts5_tokenizer>(),
        4usize,
        concat!("Alignment of ", stringify!(fts5_tokenizer))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xCreate) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fts5_tokenizer),
            "::",
            stringify!(xCreate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xDelete) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fts5_tokenizer),
            "::",
            stringify!(xDelete)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xTokenize) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fts5_tokenizer),
            "::",
            stringify!(xTokenize)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fts5_api {
    pub iVersion: ::core::ffi::c_int,
    pub xCreateTokenizer: ::core::option::Option<
        unsafe extern "C" fn(
            pApi: *mut fts5_api,
            zName: *const ::core::ffi::c_char,
            pUserData: *mut ::core::ffi::c_void,
            pTokenizer: *mut fts5_tokenizer,
            xDestroy: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        ) -> ::core::ffi::c_int,
    >,
    pub xFindTokenizer: ::core::option::Option<
        unsafe extern "C" fn(
            pApi: *mut fts5_api,
            zName: *const ::core::ffi::c_char,
            ppUserData: *mut *mut ::core::ffi::c_void,
            pTokenizer: *mut fts5_tokenizer,
        ) -> ::core::ffi::c_int,
    >,
    pub xCreateFunction: ::core::option::Option<
        unsafe extern "C" fn(
            pApi: *mut fts5_api,
            zName: *const ::core::ffi::c_char,
            pUserData: *mut ::core::ffi::c_void,
            xFunction: fts5_extension_function,
            xDestroy: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        ) -> ::core::ffi::c_int,
    >,
}
#[test]
fn bindgen_test_layout_fts5_api() {
    const UNINIT: ::core::mem::MaybeUninit<fts5_api> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<fts5_api>(),
        16usize,
        concat!("Size of: ", stringify!(fts5_api))
    );
    assert_eq!(
        ::core::mem::align_of::<fts5_api>(),
        4usize,
        concat!("Alignment of ", stringify!(fts5_api))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).iVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fts5_api),
            "::",
            stringify!(iVersion)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xCreateTokenizer) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fts5_api),
            "::",
            stringify!(xCreateTokenizer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xFindTokenizer) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fts5_api),
            "::",
            stringify!(xFindTokenizer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xCreateFunction) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(fts5_api),
            "::",
            stringify!(xCreateFunction)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sqlite3_api_routines {
    pub aggregate_context: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_context,
            nBytes: ::core::ffi::c_int,
        ) -> *mut ::core::ffi::c_void,
    >,
    pub aggregate_count: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_context) -> ::core::ffi::c_int,
    >,
    pub bind_blob: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: ::core::ffi::c_int,
            arg3: *const ::core::ffi::c_void,
            n: ::core::ffi::c_int,
            arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        ) -> ::core::ffi::c_int,
    >,
    pub bind_double: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: ::core::ffi::c_int,
            arg3: f64,
        ) -> ::core::ffi::c_int,
    >,
    pub bind_int: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: ::core::ffi::c_int,
            arg3: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub bind_int64: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: ::core::ffi::c_int,
            arg3: sqlite_int64,
        ) -> ::core::ffi::c_int,
    >,
    pub bind_null: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub bind_parameter_count:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_stmt) -> ::core::ffi::c_int>,
    pub bind_parameter_index: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            zName: *const ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub bind_parameter_name: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: ::core::ffi::c_int,
        ) -> *const ::core::ffi::c_char,
    >,
    pub bind_text: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: ::core::ffi::c_int,
            arg3: *const ::core::ffi::c_char,
            n: ::core::ffi::c_int,
            arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        ) -> ::core::ffi::c_int,
    >,
    pub bind_text16: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: ::core::ffi::c_int,
            arg3: *const ::core::ffi::c_void,
            arg4: ::core::ffi::c_int,
            arg5: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        ) -> ::core::ffi::c_int,
    >,
    pub bind_value: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: ::core::ffi::c_int,
            arg3: *const sqlite3_value,
        ) -> ::core::ffi::c_int,
    >,
    pub busy_handler: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *mut ::core::ffi::c_void,
                    arg2: ::core::ffi::c_int,
                ) -> ::core::ffi::c_int,
            >,
            arg3: *mut ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
    pub busy_timeout: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3, ms: ::core::ffi::c_int) -> ::core::ffi::c_int,
    >,
    pub changes:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3) -> ::core::ffi::c_int>,
    pub close:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3) -> ::core::ffi::c_int>,
    pub collation_needed: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *mut ::core::ffi::c_void,
            arg3: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *mut ::core::ffi::c_void,
                    arg2: *mut sqlite3,
                    eTextRep: ::core::ffi::c_int,
                    arg3: *const ::core::ffi::c_char,
                ),
            >,
        ) -> ::core::ffi::c_int,
    >,
    pub collation_needed16: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *mut ::core::ffi::c_void,
            arg3: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *mut ::core::ffi::c_void,
                    arg2: *mut sqlite3,
                    eTextRep: ::core::ffi::c_int,
                    arg3: *const ::core::ffi::c_void,
                ),
            >,
        ) -> ::core::ffi::c_int,
    >,
    pub column_blob: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            iCol: ::core::ffi::c_int,
        ) -> *const ::core::ffi::c_void,
    >,
    pub column_bytes: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            iCol: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub column_bytes16: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            iCol: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub column_count: ::core::option::Option<
        unsafe extern "C" fn(pStmt: *mut sqlite3_stmt) -> ::core::ffi::c_int,
    >,
    pub column_database_name: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: ::core::ffi::c_int,
        ) -> *const ::core::ffi::c_char,
    >,
    pub column_database_name16: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: ::core::ffi::c_int,
        ) -> *const ::core::ffi::c_void,
    >,
    pub column_decltype: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            i: ::core::ffi::c_int,
        ) -> *const ::core::ffi::c_char,
    >,
    pub column_decltype16: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: ::core::ffi::c_int,
        ) -> *const ::core::ffi::c_void,
    >,
    pub column_double: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_stmt, iCol: ::core::ffi::c_int) -> f64,
    >,
    pub column_int: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            iCol: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub column_int64: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_stmt, iCol: ::core::ffi::c_int) -> sqlite_int64,
    >,
    pub column_name: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: ::core::ffi::c_int,
        ) -> *const ::core::ffi::c_char,
    >,
    pub column_name16: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: ::core::ffi::c_int,
        ) -> *const ::core::ffi::c_void,
    >,
    pub column_origin_name: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: ::core::ffi::c_int,
        ) -> *const ::core::ffi::c_char,
    >,
    pub column_origin_name16: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: ::core::ffi::c_int,
        ) -> *const ::core::ffi::c_void,
    >,
    pub column_table_name: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: ::core::ffi::c_int,
        ) -> *const ::core::ffi::c_char,
    >,
    pub column_table_name16: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: ::core::ffi::c_int,
        ) -> *const ::core::ffi::c_void,
    >,
    pub column_text: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            iCol: ::core::ffi::c_int,
        ) -> *const ::core::ffi::c_uchar,
    >,
    pub column_text16: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            iCol: ::core::ffi::c_int,
        ) -> *const ::core::ffi::c_void,
    >,
    pub column_type: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            iCol: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub column_value: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            iCol: ::core::ffi::c_int,
        ) -> *mut sqlite3_value,
    >,
    pub commit_hook: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: ::core::option::Option<
                unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
            >,
            arg3: *mut ::core::ffi::c_void,
        ) -> *mut ::core::ffi::c_void,
    >,
    pub complete: ::core::option::Option<
        unsafe extern "C" fn(sql: *const ::core::ffi::c_char) -> ::core::ffi::c_int,
    >,
    pub complete16: ::core::option::Option<
        unsafe extern "C" fn(sql: *const ::core::ffi::c_void) -> ::core::ffi::c_int,
    >,
    pub create_collation: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
            arg3: ::core::ffi::c_int,
            arg4: *mut ::core::ffi::c_void,
            arg5: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *mut ::core::ffi::c_void,
                    arg2: ::core::ffi::c_int,
                    arg3: *const ::core::ffi::c_void,
                    arg4: ::core::ffi::c_int,
                    arg5: *const ::core::ffi::c_void,
                ) -> ::core::ffi::c_int,
            >,
        ) -> ::core::ffi::c_int,
    >,
    pub create_collation16: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_void,
            arg3: ::core::ffi::c_int,
            arg4: *mut ::core::ffi::c_void,
            arg5: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *mut ::core::ffi::c_void,
                    arg2: ::core::ffi::c_int,
                    arg3: *const ::core::ffi::c_void,
                    arg4: ::core::ffi::c_int,
                    arg5: *const ::core::ffi::c_void,
                ) -> ::core::ffi::c_int,
            >,
        ) -> ::core::ffi::c_int,
    >,
    pub create_function: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
            arg3: ::core::ffi::c_int,
            arg4: ::core::ffi::c_int,
            arg5: *mut ::core::ffi::c_void,
            xFunc: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *mut sqlite3_context,
                    arg2: ::core::ffi::c_int,
                    arg3: *mut *mut sqlite3_value,
                ),
            >,
            xStep: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *mut sqlite3_context,
                    arg2: ::core::ffi::c_int,
                    arg3: *mut *mut sqlite3_value,
                ),
            >,
            xFinal: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_context)>,
        ) -> ::core::ffi::c_int,
    >,
    pub create_function16: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_void,
            arg3: ::core::ffi::c_int,
            arg4: ::core::ffi::c_int,
            arg5: *mut ::core::ffi::c_void,
            xFunc: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *mut sqlite3_context,
                    arg2: ::core::ffi::c_int,
                    arg3: *mut *mut sqlite3_value,
                ),
            >,
            xStep: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *mut sqlite3_context,
                    arg2: ::core::ffi::c_int,
                    arg3: *mut *mut sqlite3_value,
                ),
            >,
            xFinal: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_context)>,
        ) -> ::core::ffi::c_int,
    >,
    pub create_module: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
            arg3: *const sqlite3_module,
            arg4: *mut ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
    pub data_count: ::core::option::Option<
        unsafe extern "C" fn(pStmt: *mut sqlite3_stmt) -> ::core::ffi::c_int,
    >,
    pub db_handle:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_stmt) -> *mut sqlite3>,
    pub declare_vtab: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub enable_shared_cache: ::core::option::Option<
        unsafe extern "C" fn(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int,
    >,
    pub errcode:
        ::core::option::Option<unsafe extern "C" fn(db: *mut sqlite3) -> ::core::ffi::c_int>,
    pub errmsg: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3) -> *const ::core::ffi::c_char,
    >,
    pub errmsg16: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3) -> *const ::core::ffi::c_void,
    >,
    pub exec: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
            arg3: sqlite3_callback,
            arg4: *mut ::core::ffi::c_void,
            arg5: *mut *mut ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub expired:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_stmt) -> ::core::ffi::c_int>,
    pub finalize: ::core::option::Option<
        unsafe extern "C" fn(pStmt: *mut sqlite3_stmt) -> ::core::ffi::c_int,
    >,
    pub free: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
    pub free_table:
        ::core::option::Option<unsafe extern "C" fn(result: *mut *mut ::core::ffi::c_char)>,
    pub get_autocommit:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3) -> ::core::ffi::c_int>,
    pub get_auxdata: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_context,
            arg2: ::core::ffi::c_int,
        ) -> *mut ::core::ffi::c_void,
    >,
    pub get_table: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
            arg3: *mut *mut *mut ::core::ffi::c_char,
            arg4: *mut ::core::ffi::c_int,
            arg5: *mut ::core::ffi::c_int,
            arg6: *mut *mut ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub global_recover: ::core::option::Option<unsafe extern "C" fn() -> ::core::ffi::c_int>,
    pub interruptx: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3)>,
    pub last_insert_rowid:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3) -> sqlite_int64>,
    pub libversion: ::core::option::Option<unsafe extern "C" fn() -> *const ::core::ffi::c_char>,
    pub libversion_number: ::core::option::Option<unsafe extern "C" fn() -> ::core::ffi::c_int>,
    pub malloc: ::core::option::Option<
        unsafe extern "C" fn(arg1: ::core::ffi::c_int) -> *mut ::core::ffi::c_void,
    >,
    pub mprintf: ::core::option::Option<
        unsafe extern "C" fn(arg1: *const ::core::ffi::c_char, ...) -> *mut ::core::ffi::c_char,
    >,
    pub open: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::core::ffi::c_char,
            arg2: *mut *mut sqlite3,
        ) -> ::core::ffi::c_int,
    >,
    pub open16: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::core::ffi::c_void,
            arg2: *mut *mut sqlite3,
        ) -> ::core::ffi::c_int,
    >,
    pub prepare: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
            arg3: ::core::ffi::c_int,
            arg4: *mut *mut sqlite3_stmt,
            arg5: *mut *const ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub prepare16: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_void,
            arg3: ::core::ffi::c_int,
            arg4: *mut *mut sqlite3_stmt,
            arg5: *mut *const ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
    pub profile: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *mut ::core::ffi::c_void,
                    arg2: *const ::core::ffi::c_char,
                    arg3: sqlite_uint64,
                ),
            >,
            arg3: *mut ::core::ffi::c_void,
        ) -> *mut ::core::ffi::c_void,
    >,
    pub progress_handler: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: ::core::ffi::c_int,
            arg3: ::core::option::Option<
                unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> ::core::ffi::c_int,
            >,
            arg4: *mut ::core::ffi::c_void,
        ),
    >,
    pub realloc: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::core::ffi::c_void,
            arg2: ::core::ffi::c_int,
        ) -> *mut ::core::ffi::c_void,
    >,
    pub reset: ::core::option::Option<
        unsafe extern "C" fn(pStmt: *mut sqlite3_stmt) -> ::core::ffi::c_int,
    >,
    pub result_blob: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_context,
            arg2: *const ::core::ffi::c_void,
            arg3: ::core::ffi::c_int,
            arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        ),
    >,
    pub result_double:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_context, arg2: f64)>,
    pub result_error: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_context,
            arg2: *const ::core::ffi::c_char,
            arg3: ::core::ffi::c_int,
        ),
    >,
    pub result_error16: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_context,
            arg2: *const ::core::ffi::c_void,
            arg3: ::core::ffi::c_int,
        ),
    >,
    pub result_int: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_context, arg2: ::core::ffi::c_int),
    >,
    pub result_int64: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_context, arg2: sqlite_int64),
    >,
    pub result_null: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_context)>,
    pub result_text: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_context,
            arg2: *const ::core::ffi::c_char,
            arg3: ::core::ffi::c_int,
            arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        ),
    >,
    pub result_text16: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_context,
            arg2: *const ::core::ffi::c_void,
            arg3: ::core::ffi::c_int,
            arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        ),
    >,
    pub result_text16be: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_context,
            arg2: *const ::core::ffi::c_void,
            arg3: ::core::ffi::c_int,
            arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        ),
    >,
    pub result_text16le: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_context,
            arg2: *const ::core::ffi::c_void,
            arg3: ::core::ffi::c_int,
            arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        ),
    >,
    pub result_value: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_context, arg2: *mut sqlite3_value),
    >,
    pub rollback_hook: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
            arg3: *mut ::core::ffi::c_void,
        ) -> *mut ::core::ffi::c_void,
    >,
    pub set_authorizer: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *mut ::core::ffi::c_void,
                    arg2: ::core::ffi::c_int,
                    arg3: *const ::core::ffi::c_char,
                    arg4: *const ::core::ffi::c_char,
                    arg5: *const ::core::ffi::c_char,
                    arg6: *const ::core::ffi::c_char,
                ) -> ::core::ffi::c_int,
            >,
            arg3: *mut ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
    pub set_auxdata: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_context,
            arg2: ::core::ffi::c_int,
            arg3: *mut ::core::ffi::c_void,
            arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        ),
    >,
    pub xsnprintf: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: ::core::ffi::c_int,
            arg2: *mut ::core::ffi::c_char,
            arg3: *const ::core::ffi::c_char,
            ...
        ) -> *mut ::core::ffi::c_char,
    >,
    pub step:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_stmt) -> ::core::ffi::c_int>,
    pub table_column_metadata: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
            arg3: *const ::core::ffi::c_char,
            arg4: *const ::core::ffi::c_char,
            arg5: *mut *const ::core::ffi::c_char,
            arg6: *mut *const ::core::ffi::c_char,
            arg7: *mut ::core::ffi::c_int,
            arg8: *mut ::core::ffi::c_int,
            arg9: *mut ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub thread_cleanup: ::core::option::Option<unsafe extern "C" fn()>,
    pub total_changes:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3) -> ::core::ffi::c_int>,
    pub trace: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            xTrace: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *mut ::core::ffi::c_void,
                    arg2: *const ::core::ffi::c_char,
                ),
            >,
            arg2: *mut ::core::ffi::c_void,
        ) -> *mut ::core::ffi::c_void,
    >,
    pub transfer_bindings: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: *mut sqlite3_stmt,
        ) -> ::core::ffi::c_int,
    >,
    pub update_hook: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *mut ::core::ffi::c_void,
                    arg2: ::core::ffi::c_int,
                    arg3: *const ::core::ffi::c_char,
                    arg4: *const ::core::ffi::c_char,
                    arg5: sqlite_int64,
                ),
            >,
            arg3: *mut ::core::ffi::c_void,
        ) -> *mut ::core::ffi::c_void,
    >,
    pub user_data: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_context) -> *mut ::core::ffi::c_void,
    >,
    pub value_blob: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_value) -> *const ::core::ffi::c_void,
    >,
    pub value_bytes: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_value) -> ::core::ffi::c_int,
    >,
    pub value_bytes16: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_value) -> ::core::ffi::c_int,
    >,
    pub value_double: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_value) -> f64>,
    pub value_int: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_value) -> ::core::ffi::c_int,
    >,
    pub value_int64:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_value) -> sqlite_int64>,
    pub value_numeric_type: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_value) -> ::core::ffi::c_int,
    >,
    pub value_text: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_value) -> *const ::core::ffi::c_uchar,
    >,
    pub value_text16: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_value) -> *const ::core::ffi::c_void,
    >,
    pub value_text16be: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_value) -> *const ::core::ffi::c_void,
    >,
    pub value_text16le: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_value) -> *const ::core::ffi::c_void,
    >,
    pub value_type: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_value) -> ::core::ffi::c_int,
    >,
    pub vmprintf: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::core::ffi::c_char,
            arg2: va_list,
        ) -> *mut ::core::ffi::c_char,
    >,
    pub overload_function: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            zFuncName: *const ::core::ffi::c_char,
            nArg: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub prepare_v2: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
            arg3: ::core::ffi::c_int,
            arg4: *mut *mut sqlite3_stmt,
            arg5: *mut *const ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub prepare16_v2: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_void,
            arg3: ::core::ffi::c_int,
            arg4: *mut *mut sqlite3_stmt,
            arg5: *mut *const ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
    pub clear_bindings:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_stmt) -> ::core::ffi::c_int>,
    pub create_module_v2: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
            arg3: *const sqlite3_module,
            arg4: *mut ::core::ffi::c_void,
            xDestroy: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        ) -> ::core::ffi::c_int,
    >,
    pub bind_zeroblob: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: ::core::ffi::c_int,
            arg3: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub blob_bytes:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_blob) -> ::core::ffi::c_int>,
    pub blob_close:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_blob) -> ::core::ffi::c_int>,
    pub blob_open: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
            arg3: *const ::core::ffi::c_char,
            arg4: *const ::core::ffi::c_char,
            arg5: sqlite3_int64,
            arg6: ::core::ffi::c_int,
            arg7: *mut *mut sqlite3_blob,
        ) -> ::core::ffi::c_int,
    >,
    pub blob_read: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_blob,
            arg2: *mut ::core::ffi::c_void,
            arg3: ::core::ffi::c_int,
            arg4: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub blob_write: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_blob,
            arg2: *const ::core::ffi::c_void,
            arg3: ::core::ffi::c_int,
            arg4: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub create_collation_v2: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
            arg3: ::core::ffi::c_int,
            arg4: *mut ::core::ffi::c_void,
            arg5: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *mut ::core::ffi::c_void,
                    arg2: ::core::ffi::c_int,
                    arg3: *const ::core::ffi::c_void,
                    arg4: ::core::ffi::c_int,
                    arg5: *const ::core::ffi::c_void,
                ) -> ::core::ffi::c_int,
            >,
            arg6: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        ) -> ::core::ffi::c_int,
    >,
    pub file_control: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
            arg3: ::core::ffi::c_int,
            arg4: *mut ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
    pub memory_highwater:
        ::core::option::Option<unsafe extern "C" fn(arg1: ::core::ffi::c_int) -> sqlite3_int64>,
    pub memory_used: ::core::option::Option<unsafe extern "C" fn() -> sqlite3_int64>,
    pub mutex_alloc: ::core::option::Option<
        unsafe extern "C" fn(arg1: ::core::ffi::c_int) -> *mut sqlite3_mutex,
    >,
    pub mutex_enter: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_mutex)>,
    pub mutex_free: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_mutex)>,
    pub mutex_leave: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_mutex)>,
    pub mutex_try: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_mutex) -> ::core::ffi::c_int,
    >,
    pub open_v2: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::core::ffi::c_char,
            arg2: *mut *mut sqlite3,
            arg3: ::core::ffi::c_int,
            arg4: *const ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub release_memory: ::core::option::Option<
        unsafe extern "C" fn(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int,
    >,
    pub result_error_nomem:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_context)>,
    pub result_error_toobig:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_context)>,
    pub sleep: ::core::option::Option<
        unsafe extern "C" fn(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int,
    >,
    pub soft_heap_limit: ::core::option::Option<unsafe extern "C" fn(arg1: ::core::ffi::c_int)>,
    pub vfs_find: ::core::option::Option<
        unsafe extern "C" fn(arg1: *const ::core::ffi::c_char) -> *mut sqlite3_vfs,
    >,
    pub vfs_register: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_vfs,
            arg2: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub vfs_unregister:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_vfs) -> ::core::ffi::c_int>,
    pub xthreadsafe: ::core::option::Option<unsafe extern "C" fn() -> ::core::ffi::c_int>,
    pub result_zeroblob: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_context, arg2: ::core::ffi::c_int),
    >,
    pub result_error_code: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_context, arg2: ::core::ffi::c_int),
    >,
    pub test_control: ::core::option::Option<
        unsafe extern "C" fn(arg1: ::core::ffi::c_int, ...) -> ::core::ffi::c_int,
    >,
    pub randomness: ::core::option::Option<
        unsafe extern "C" fn(arg1: ::core::ffi::c_int, arg2: *mut ::core::ffi::c_void),
    >,
    pub context_db_handle:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_context) -> *mut sqlite3>,
    pub extended_result_codes: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3, arg2: ::core::ffi::c_int) -> ::core::ffi::c_int,
    >,
    pub limit: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: ::core::ffi::c_int,
            arg3: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub next_stmt: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3, arg2: *mut sqlite3_stmt) -> *mut sqlite3_stmt,
    >,
    pub sql: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_stmt) -> *const ::core::ffi::c_char,
    >,
    pub status: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: ::core::ffi::c_int,
            arg2: *mut ::core::ffi::c_int,
            arg3: *mut ::core::ffi::c_int,
            arg4: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub backup_finish: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_backup) -> ::core::ffi::c_int,
    >,
    pub backup_init: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
            arg3: *mut sqlite3,
            arg4: *const ::core::ffi::c_char,
        ) -> *mut sqlite3_backup,
    >,
    pub backup_pagecount: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_backup) -> ::core::ffi::c_int,
    >,
    pub backup_remaining: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_backup) -> ::core::ffi::c_int,
    >,
    pub backup_step: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_backup,
            arg2: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub compileoption_get: ::core::option::Option<
        unsafe extern "C" fn(arg1: ::core::ffi::c_int) -> *const ::core::ffi::c_char,
    >,
    pub compileoption_used: ::core::option::Option<
        unsafe extern "C" fn(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_int,
    >,
    pub create_function_v2: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
            arg3: ::core::ffi::c_int,
            arg4: ::core::ffi::c_int,
            arg5: *mut ::core::ffi::c_void,
            xFunc: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *mut sqlite3_context,
                    arg2: ::core::ffi::c_int,
                    arg3: *mut *mut sqlite3_value,
                ),
            >,
            xStep: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *mut sqlite3_context,
                    arg2: ::core::ffi::c_int,
                    arg3: *mut *mut sqlite3_value,
                ),
            >,
            xFinal: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_context)>,
            xDestroy: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        ) -> ::core::ffi::c_int,
    >,
    pub db_config: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: ::core::ffi::c_int,
            ...
        ) -> ::core::ffi::c_int,
    >,
    pub db_mutex:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3) -> *mut sqlite3_mutex>,
    pub db_status: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: ::core::ffi::c_int,
            arg3: *mut ::core::ffi::c_int,
            arg4: *mut ::core::ffi::c_int,
            arg5: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub extended_errcode:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3) -> ::core::ffi::c_int>,
    pub log: ::core::option::Option<
        unsafe extern "C" fn(arg1: ::core::ffi::c_int, arg2: *const ::core::ffi::c_char, ...),
    >,
    pub soft_heap_limit64:
        ::core::option::Option<unsafe extern "C" fn(arg1: sqlite3_int64) -> sqlite3_int64>,
    pub sourceid: ::core::option::Option<unsafe extern "C" fn() -> *const ::core::ffi::c_char>,
    pub stmt_status: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: ::core::ffi::c_int,
            arg3: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub strnicmp: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::core::ffi::c_char,
            arg2: *const ::core::ffi::c_char,
            arg3: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub unlock_notify: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: ::core::option::Option<
                unsafe extern "C" fn(arg1: *mut *mut ::core::ffi::c_void, arg2: ::core::ffi::c_int),
            >,
            arg3: *mut ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
    pub wal_autocheckpoint: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3, arg2: ::core::ffi::c_int) -> ::core::ffi::c_int,
    >,
    pub wal_checkpoint: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub wal_hook: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *mut ::core::ffi::c_void,
                    arg2: *mut sqlite3,
                    arg3: *const ::core::ffi::c_char,
                    arg4: ::core::ffi::c_int,
                ) -> ::core::ffi::c_int,
            >,
            arg3: *mut ::core::ffi::c_void,
        ) -> *mut ::core::ffi::c_void,
    >,
    pub blob_reopen: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_blob, arg2: sqlite3_int64) -> ::core::ffi::c_int,
    >,
    pub vtab_config: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3, op: ::core::ffi::c_int, ...) -> ::core::ffi::c_int,
    >,
    pub vtab_on_conflict:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3) -> ::core::ffi::c_int>,
    pub close_v2:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3) -> ::core::ffi::c_int>,
    pub db_filename: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
        ) -> *const ::core::ffi::c_char,
    >,
    pub db_readonly: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub db_release_memory:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3) -> ::core::ffi::c_int>,
    pub errstr: ::core::option::Option<
        unsafe extern "C" fn(arg1: ::core::ffi::c_int) -> *const ::core::ffi::c_char,
    >,
    pub stmt_busy:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_stmt) -> ::core::ffi::c_int>,
    pub stmt_readonly:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_stmt) -> ::core::ffi::c_int>,
    pub stricmp: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::core::ffi::c_char,
            arg2: *const ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub uri_boolean: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::core::ffi::c_char,
            arg2: *const ::core::ffi::c_char,
            arg3: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub uri_int64: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::core::ffi::c_char,
            arg2: *const ::core::ffi::c_char,
            arg3: sqlite3_int64,
        ) -> sqlite3_int64,
    >,
    pub uri_parameter: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::core::ffi::c_char,
            arg2: *const ::core::ffi::c_char,
        ) -> *const ::core::ffi::c_char,
    >,
    pub xvsnprintf: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: ::core::ffi::c_int,
            arg2: *mut ::core::ffi::c_char,
            arg3: *const ::core::ffi::c_char,
            arg4: va_list,
        ) -> *mut ::core::ffi::c_char,
    >,
    pub wal_checkpoint_v2: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
            arg3: ::core::ffi::c_int,
            arg4: *mut ::core::ffi::c_int,
            arg5: *mut ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub auto_extension: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: ::core::option::Option<unsafe extern "C" fn()>,
        ) -> ::core::ffi::c_int,
    >,
    pub bind_blob64: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: ::core::ffi::c_int,
            arg3: *const ::core::ffi::c_void,
            arg4: sqlite3_uint64,
            arg5: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        ) -> ::core::ffi::c_int,
    >,
    pub bind_text64: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: ::core::ffi::c_int,
            arg3: *const ::core::ffi::c_char,
            arg4: sqlite3_uint64,
            arg5: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
            arg6: ::core::ffi::c_uchar,
        ) -> ::core::ffi::c_int,
    >,
    pub cancel_auto_extension: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: ::core::option::Option<unsafe extern "C" fn()>,
        ) -> ::core::ffi::c_int,
    >,
    pub load_extension: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
            arg3: *const ::core::ffi::c_char,
            arg4: *mut *mut ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub malloc64: ::core::option::Option<
        unsafe extern "C" fn(arg1: sqlite3_uint64) -> *mut ::core::ffi::c_void,
    >,
    pub msize: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void) -> sqlite3_uint64,
    >,
    pub realloc64: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::core::ffi::c_void,
            arg2: sqlite3_uint64,
        ) -> *mut ::core::ffi::c_void,
    >,
    pub reset_auto_extension: ::core::option::Option<unsafe extern "C" fn()>,
    pub result_blob64: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_context,
            arg2: *const ::core::ffi::c_void,
            arg3: sqlite3_uint64,
            arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        ),
    >,
    pub result_text64: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_context,
            arg2: *const ::core::ffi::c_char,
            arg3: sqlite3_uint64,
            arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
            arg5: ::core::ffi::c_uchar,
        ),
    >,
    pub strglob: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::core::ffi::c_char,
            arg2: *const ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub value_dup: ::core::option::Option<
        unsafe extern "C" fn(arg1: *const sqlite3_value) -> *mut sqlite3_value,
    >,
    pub value_free: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_value)>,
    pub result_zeroblob64: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_context,
            arg2: sqlite3_uint64,
        ) -> ::core::ffi::c_int,
    >,
    pub bind_zeroblob64: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: ::core::ffi::c_int,
            arg3: sqlite3_uint64,
        ) -> ::core::ffi::c_int,
    >,
    pub value_subtype: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_value) -> ::core::ffi::c_uint,
    >,
    pub result_subtype: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_context, arg2: ::core::ffi::c_uint),
    >,
    pub status64: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: ::core::ffi::c_int,
            arg2: *mut sqlite3_int64,
            arg3: *mut sqlite3_int64,
            arg4: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub strlike: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::core::ffi::c_char,
            arg2: *const ::core::ffi::c_char,
            arg3: ::core::ffi::c_uint,
        ) -> ::core::ffi::c_int,
    >,
    pub db_cacheflush:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3) -> ::core::ffi::c_int>,
    pub system_errno:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3) -> ::core::ffi::c_int>,
    pub trace_v2: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: ::core::ffi::c_uint,
            arg3: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: ::core::ffi::c_uint,
                    arg2: *mut ::core::ffi::c_void,
                    arg3: *mut ::core::ffi::c_void,
                    arg4: *mut ::core::ffi::c_void,
                ) -> ::core::ffi::c_int,
            >,
            arg4: *mut ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
    pub expanded_sql: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_stmt) -> *mut ::core::ffi::c_char,
    >,
    pub set_last_insert_rowid:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3, arg2: sqlite3_int64)>,
    pub prepare_v3: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
            arg3: ::core::ffi::c_int,
            arg4: ::core::ffi::c_uint,
            arg5: *mut *mut sqlite3_stmt,
            arg6: *mut *const ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub prepare16_v3: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_void,
            arg3: ::core::ffi::c_int,
            arg4: ::core::ffi::c_uint,
            arg5: *mut *mut sqlite3_stmt,
            arg6: *mut *const ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
    pub bind_pointer: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: ::core::ffi::c_int,
            arg3: *mut ::core::ffi::c_void,
            arg4: *const ::core::ffi::c_char,
            arg5: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        ) -> ::core::ffi::c_int,
    >,
    pub result_pointer: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_context,
            arg2: *mut ::core::ffi::c_void,
            arg3: *const ::core::ffi::c_char,
            arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        ),
    >,
    pub value_pointer: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_value,
            arg2: *const ::core::ffi::c_char,
        ) -> *mut ::core::ffi::c_void,
    >,
    pub vtab_nochange: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_context) -> ::core::ffi::c_int,
    >,
    pub value_nochange: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_value) -> ::core::ffi::c_int,
    >,
    pub vtab_collation: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_index_info,
            arg2: ::core::ffi::c_int,
        ) -> *const ::core::ffi::c_char,
    >,
    pub keyword_count: ::core::option::Option<unsafe extern "C" fn() -> ::core::ffi::c_int>,
    pub keyword_name: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: ::core::ffi::c_int,
            arg2: *mut *const ::core::ffi::c_char,
            arg3: *mut ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub keyword_check: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::core::ffi::c_char,
            arg2: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub str_new:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3) -> *mut sqlite3_str>,
    pub str_finish: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_str) -> *mut ::core::ffi::c_char,
    >,
    pub str_appendf: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_str, zFormat: *const ::core::ffi::c_char, ...),
    >,
    pub str_vappendf: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_str,
            zFormat: *const ::core::ffi::c_char,
            arg2: va_list,
        ),
    >,
    pub str_append: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_str,
            zIn: *const ::core::ffi::c_char,
            N: ::core::ffi::c_int,
        ),
    >,
    pub str_appendall: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_str, zIn: *const ::core::ffi::c_char),
    >,
    pub str_appendchar: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_str, N: ::core::ffi::c_int, C: ::core::ffi::c_char),
    >,
    pub str_reset: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_str)>,
    pub str_errcode:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_str) -> ::core::ffi::c_int>,
    pub str_length:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_str) -> ::core::ffi::c_int>,
    pub str_value: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_str) -> *mut ::core::ffi::c_char,
    >,
    pub create_window_function: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
            arg3: ::core::ffi::c_int,
            arg4: ::core::ffi::c_int,
            arg5: *mut ::core::ffi::c_void,
            xStep: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *mut sqlite3_context,
                    arg2: ::core::ffi::c_int,
                    arg3: *mut *mut sqlite3_value,
                ),
            >,
            xFinal: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_context)>,
            xValue: ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_context)>,
            xInv: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *mut sqlite3_context,
                    arg2: ::core::ffi::c_int,
                    arg3: *mut *mut sqlite3_value,
                ),
            >,
            xDestroy: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        ) -> ::core::ffi::c_int,
    >,
    pub normalized_sql: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_stmt) -> *const ::core::ffi::c_char,
    >,
    pub stmt_isexplain:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3_stmt) -> ::core::ffi::c_int>,
    pub value_frombind: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_value) -> ::core::ffi::c_int,
    >,
    pub drop_modules: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *mut *const ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub hard_heap_limit64:
        ::core::option::Option<unsafe extern "C" fn(arg1: sqlite3_int64) -> sqlite3_int64>,
    pub uri_key: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::core::ffi::c_char,
            arg2: ::core::ffi::c_int,
        ) -> *const ::core::ffi::c_char,
    >,
    pub filename_database: ::core::option::Option<
        unsafe extern "C" fn(arg1: *const ::core::ffi::c_char) -> *const ::core::ffi::c_char,
    >,
    pub filename_journal: ::core::option::Option<
        unsafe extern "C" fn(arg1: *const ::core::ffi::c_char) -> *const ::core::ffi::c_char,
    >,
    pub filename_wal: ::core::option::Option<
        unsafe extern "C" fn(arg1: *const ::core::ffi::c_char) -> *const ::core::ffi::c_char,
    >,
    pub create_filename: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::core::ffi::c_char,
            arg2: *const ::core::ffi::c_char,
            arg3: *const ::core::ffi::c_char,
            arg4: ::core::ffi::c_int,
            arg5: *mut *const ::core::ffi::c_char,
        ) -> *const ::core::ffi::c_char,
    >,
    pub free_filename:
        ::core::option::Option<unsafe extern "C" fn(arg1: *const ::core::ffi::c_char)>,
    pub database_file_object: ::core::option::Option<
        unsafe extern "C" fn(arg1: *const ::core::ffi::c_char) -> *mut sqlite3_file,
    >,
    pub txn_state: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
        ) -> ::core::ffi::c_int,
    >,
    pub changes64:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3) -> sqlite3_int64>,
    pub total_changes64:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3) -> sqlite3_int64>,
    pub autovacuum_pages: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: ::core::option::Option<
                unsafe extern "C" fn(
                    arg1: *mut ::core::ffi::c_void,
                    arg2: *const ::core::ffi::c_char,
                    arg3: ::core::ffi::c_uint,
                    arg4: ::core::ffi::c_uint,
                    arg5: ::core::ffi::c_uint,
                ) -> ::core::ffi::c_uint,
            >,
            arg3: *mut ::core::ffi::c_void,
            arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        ) -> ::core::ffi::c_int,
    >,
    pub error_offset:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3) -> ::core::ffi::c_int>,
    pub vtab_rhs_value: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_index_info,
            arg2: ::core::ffi::c_int,
            arg3: *mut *mut sqlite3_value,
        ) -> ::core::ffi::c_int,
    >,
    pub vtab_distinct: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_index_info) -> ::core::ffi::c_int,
    >,
    pub vtab_in: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_index_info,
            arg2: ::core::ffi::c_int,
            arg3: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub vtab_in_first: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_value,
            arg2: *mut *mut sqlite3_value,
        ) -> ::core::ffi::c_int,
    >,
    pub vtab_in_next: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_value,
            arg2: *mut *mut sqlite3_value,
        ) -> ::core::ffi::c_int,
    >,
    pub deserialize: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
            arg3: *mut ::core::ffi::c_uchar,
            arg4: sqlite3_int64,
            arg5: sqlite3_int64,
            arg6: ::core::ffi::c_uint,
        ) -> ::core::ffi::c_int,
    >,
    pub serialize: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
            arg3: *mut sqlite3_int64,
            arg4: ::core::ffi::c_uint,
        ) -> *mut ::core::ffi::c_uchar,
    >,
    pub db_name: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: ::core::ffi::c_int,
        ) -> *const ::core::ffi::c_char,
    >,
    pub value_encoding: ::core::option::Option<
        unsafe extern "C" fn(arg1: *mut sqlite3_value) -> ::core::ffi::c_int,
    >,
    pub is_interrupted:
        ::core::option::Option<unsafe extern "C" fn(arg1: *mut sqlite3) -> ::core::ffi::c_int>,
    pub stmt_explain: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3_stmt,
            arg2: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub get_clientdata: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
        ) -> *mut ::core::ffi::c_void,
    >,
    pub set_clientdata: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut sqlite3,
            arg2: *const ::core::ffi::c_char,
            arg3: *mut ::core::ffi::c_void,
            arg4: ::core::option::Option<unsafe extern "C" fn(arg1: *mut ::core::ffi::c_void)>,
        ) -> ::core::ffi::c_int,
    >,
}
#[test]
fn bindgen_test_layout_sqlite3_api_routines() {
    const UNINIT: ::core::mem::MaybeUninit<sqlite3_api_routines> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sqlite3_api_routines>(),
        1080usize,
        concat!("Size of: ", stringify!(sqlite3_api_routines))
    );
    assert_eq!(
        ::core::mem::align_of::<sqlite3_api_routines>(),
        4usize,
        concat!("Alignment of ", stringify!(sqlite3_api_routines))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).aggregate_context) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(aggregate_context)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).aggregate_count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(aggregate_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bind_blob) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(bind_blob)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bind_double) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(bind_double)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bind_int) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(bind_int)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bind_int64) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(bind_int64)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bind_null) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(bind_null)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bind_parameter_count) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(bind_parameter_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bind_parameter_index) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(bind_parameter_index)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bind_parameter_name) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(bind_parameter_name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bind_text) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(bind_text)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bind_text16) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(bind_text16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bind_value) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(bind_value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).busy_handler) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(busy_handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).busy_timeout) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(busy_timeout)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).changes) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(changes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).close) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(close)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).collation_needed) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(collation_needed)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).collation_needed16) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(collation_needed16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).column_blob) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(column_blob)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).column_bytes) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(column_bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).column_bytes16) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(column_bytes16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).column_count) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(column_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).column_database_name) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(column_database_name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).column_database_name16) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(column_database_name16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).column_decltype) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(column_decltype)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).column_decltype16) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(column_decltype16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).column_double) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(column_double)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).column_int) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(column_int)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).column_int64) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(column_int64)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).column_name) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(column_name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).column_name16) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(column_name16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).column_origin_name) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(column_origin_name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).column_origin_name16) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(column_origin_name16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).column_table_name) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(column_table_name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).column_table_name16) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(column_table_name16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).column_text) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(column_text)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).column_text16) as usize - ptr as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(column_text16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).column_type) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(column_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).column_value) as usize - ptr as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(column_value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).commit_hook) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(commit_hook)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).complete) as usize - ptr as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(complete)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).complete16) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(complete16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).create_collation) as usize - ptr as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(create_collation)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).create_collation16) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(create_collation16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).create_function) as usize - ptr as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(create_function)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).create_function16) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(create_function16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).create_module) as usize - ptr as usize },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(create_module)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data_count) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(data_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).db_handle) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(db_handle)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).declare_vtab) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(declare_vtab)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).enable_shared_cache) as usize - ptr as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(enable_shared_cache)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).errcode) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(errcode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).errmsg) as usize - ptr as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(errmsg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).errmsg16) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(errmsg16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).exec) as usize - ptr as usize },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(exec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).expired) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(expired)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).finalize) as usize - ptr as usize },
        228usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(finalize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).free) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(free)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).free_table) as usize - ptr as usize },
        236usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(free_table)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).get_autocommit) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(get_autocommit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).get_auxdata) as usize - ptr as usize },
        244usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(get_auxdata)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).get_table) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(get_table)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).global_recover) as usize - ptr as usize },
        252usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(global_recover)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).interruptx) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(interruptx)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).last_insert_rowid) as usize - ptr as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(last_insert_rowid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).libversion) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(libversion)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).libversion_number) as usize - ptr as usize },
        268usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(libversion_number)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).malloc) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(malloc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mprintf) as usize - ptr as usize },
        276usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(mprintf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).open) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(open)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).open16) as usize - ptr as usize },
        284usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(open16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prepare) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(prepare)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prepare16) as usize - ptr as usize },
        292usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(prepare16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).profile) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(profile)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).progress_handler) as usize - ptr as usize },
        300usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(progress_handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).realloc) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(realloc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reset) as usize - ptr as usize },
        308usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(reset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).result_blob) as usize - ptr as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(result_blob)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).result_double) as usize - ptr as usize },
        316usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(result_double)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).result_error) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(result_error)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).result_error16) as usize - ptr as usize },
        324usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(result_error16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).result_int) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(result_int)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).result_int64) as usize - ptr as usize },
        332usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(result_int64)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).result_null) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(result_null)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).result_text) as usize - ptr as usize },
        340usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(result_text)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).result_text16) as usize - ptr as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(result_text16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).result_text16be) as usize - ptr as usize },
        348usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(result_text16be)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).result_text16le) as usize - ptr as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(result_text16le)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).result_value) as usize - ptr as usize },
        356usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(result_value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rollback_hook) as usize - ptr as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(rollback_hook)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).set_authorizer) as usize - ptr as usize },
        364usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(set_authorizer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).set_auxdata) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(set_auxdata)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xsnprintf) as usize - ptr as usize },
        372usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(xsnprintf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).step) as usize - ptr as usize },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(step)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table_column_metadata) as usize - ptr as usize },
        380usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(table_column_metadata)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).thread_cleanup) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(thread_cleanup)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).total_changes) as usize - ptr as usize },
        388usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(total_changes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).trace) as usize - ptr as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(trace)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).transfer_bindings) as usize - ptr as usize },
        396usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(transfer_bindings)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).update_hook) as usize - ptr as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(update_hook)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).user_data) as usize - ptr as usize },
        404usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(user_data)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_blob) as usize - ptr as usize },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(value_blob)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_bytes) as usize - ptr as usize },
        412usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(value_bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_bytes16) as usize - ptr as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(value_bytes16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_double) as usize - ptr as usize },
        420usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(value_double)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_int) as usize - ptr as usize },
        424usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(value_int)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_int64) as usize - ptr as usize },
        428usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(value_int64)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_numeric_type) as usize - ptr as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(value_numeric_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_text) as usize - ptr as usize },
        436usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(value_text)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_text16) as usize - ptr as usize },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(value_text16)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_text16be) as usize - ptr as usize },
        444usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(value_text16be)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_text16le) as usize - ptr as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(value_text16le)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_type) as usize - ptr as usize },
        452usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(value_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vmprintf) as usize - ptr as usize },
        456usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(vmprintf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).overload_function) as usize - ptr as usize },
        460usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(overload_function)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prepare_v2) as usize - ptr as usize },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(prepare_v2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prepare16_v2) as usize - ptr as usize },
        468usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(prepare16_v2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clear_bindings) as usize - ptr as usize },
        472usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(clear_bindings)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).create_module_v2) as usize - ptr as usize },
        476usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(create_module_v2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bind_zeroblob) as usize - ptr as usize },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(bind_zeroblob)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).blob_bytes) as usize - ptr as usize },
        484usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(blob_bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).blob_close) as usize - ptr as usize },
        488usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(blob_close)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).blob_open) as usize - ptr as usize },
        492usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(blob_open)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).blob_read) as usize - ptr as usize },
        496usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(blob_read)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).blob_write) as usize - ptr as usize },
        500usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(blob_write)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).create_collation_v2) as usize - ptr as usize },
        504usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(create_collation_v2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).file_control) as usize - ptr as usize },
        508usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(file_control)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).memory_highwater) as usize - ptr as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(memory_highwater)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).memory_used) as usize - ptr as usize },
        516usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(memory_used)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mutex_alloc) as usize - ptr as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(mutex_alloc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mutex_enter) as usize - ptr as usize },
        524usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(mutex_enter)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mutex_free) as usize - ptr as usize },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(mutex_free)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mutex_leave) as usize - ptr as usize },
        532usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(mutex_leave)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mutex_try) as usize - ptr as usize },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(mutex_try)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).open_v2) as usize - ptr as usize },
        540usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(open_v2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).release_memory) as usize - ptr as usize },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(release_memory)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).result_error_nomem) as usize - ptr as usize },
        548usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(result_error_nomem)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).result_error_toobig) as usize - ptr as usize },
        552usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(result_error_toobig)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sleep) as usize - ptr as usize },
        556usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(sleep)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).soft_heap_limit) as usize - ptr as usize },
        560usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(soft_heap_limit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vfs_find) as usize - ptr as usize },
        564usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(vfs_find)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vfs_register) as usize - ptr as usize },
        568usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(vfs_register)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vfs_unregister) as usize - ptr as usize },
        572usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(vfs_unregister)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xthreadsafe) as usize - ptr as usize },
        576usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(xthreadsafe)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).result_zeroblob) as usize - ptr as usize },
        580usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(result_zeroblob)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).result_error_code) as usize - ptr as usize },
        584usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(result_error_code)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).test_control) as usize - ptr as usize },
        588usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(test_control)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).randomness) as usize - ptr as usize },
        592usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(randomness)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).context_db_handle) as usize - ptr as usize },
        596usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(context_db_handle)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).extended_result_codes) as usize - ptr as usize },
        600usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(extended_result_codes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).limit) as usize - ptr as usize },
        604usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(limit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next_stmt) as usize - ptr as usize },
        608usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(next_stmt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sql) as usize - ptr as usize },
        612usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(sql)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        616usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).backup_finish) as usize - ptr as usize },
        620usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(backup_finish)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).backup_init) as usize - ptr as usize },
        624usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(backup_init)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).backup_pagecount) as usize - ptr as usize },
        628usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(backup_pagecount)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).backup_remaining) as usize - ptr as usize },
        632usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(backup_remaining)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).backup_step) as usize - ptr as usize },
        636usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(backup_step)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).compileoption_get) as usize - ptr as usize },
        640usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(compileoption_get)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).compileoption_used) as usize - ptr as usize },
        644usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(compileoption_used)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).create_function_v2) as usize - ptr as usize },
        648usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(create_function_v2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).db_config) as usize - ptr as usize },
        652usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(db_config)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).db_mutex) as usize - ptr as usize },
        656usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(db_mutex)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).db_status) as usize - ptr as usize },
        660usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(db_status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).extended_errcode) as usize - ptr as usize },
        664usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(extended_errcode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).log) as usize - ptr as usize },
        668usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(log)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).soft_heap_limit64) as usize - ptr as usize },
        672usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(soft_heap_limit64)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sourceid) as usize - ptr as usize },
        676usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(sourceid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stmt_status) as usize - ptr as usize },
        680usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(stmt_status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).strnicmp) as usize - ptr as usize },
        684usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(strnicmp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).unlock_notify) as usize - ptr as usize },
        688usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(unlock_notify)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wal_autocheckpoint) as usize - ptr as usize },
        692usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(wal_autocheckpoint)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wal_checkpoint) as usize - ptr as usize },
        696usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(wal_checkpoint)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wal_hook) as usize - ptr as usize },
        700usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(wal_hook)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).blob_reopen) as usize - ptr as usize },
        704usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(blob_reopen)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vtab_config) as usize - ptr as usize },
        708usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(vtab_config)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vtab_on_conflict) as usize - ptr as usize },
        712usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(vtab_on_conflict)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).close_v2) as usize - ptr as usize },
        716usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(close_v2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).db_filename) as usize - ptr as usize },
        720usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(db_filename)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).db_readonly) as usize - ptr as usize },
        724usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(db_readonly)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).db_release_memory) as usize - ptr as usize },
        728usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(db_release_memory)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).errstr) as usize - ptr as usize },
        732usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(errstr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stmt_busy) as usize - ptr as usize },
        736usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(stmt_busy)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stmt_readonly) as usize - ptr as usize },
        740usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(stmt_readonly)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stricmp) as usize - ptr as usize },
        744usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(stricmp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).uri_boolean) as usize - ptr as usize },
        748usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(uri_boolean)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).uri_int64) as usize - ptr as usize },
        752usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(uri_int64)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).uri_parameter) as usize - ptr as usize },
        756usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(uri_parameter)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xvsnprintf) as usize - ptr as usize },
        760usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(xvsnprintf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wal_checkpoint_v2) as usize - ptr as usize },
        764usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(wal_checkpoint_v2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).auto_extension) as usize - ptr as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(auto_extension)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bind_blob64) as usize - ptr as usize },
        772usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(bind_blob64)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bind_text64) as usize - ptr as usize },
        776usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(bind_text64)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cancel_auto_extension) as usize - ptr as usize },
        780usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(cancel_auto_extension)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).load_extension) as usize - ptr as usize },
        784usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(load_extension)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).malloc64) as usize - ptr as usize },
        788usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(malloc64)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).msize) as usize - ptr as usize },
        792usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(msize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).realloc64) as usize - ptr as usize },
        796usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(realloc64)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reset_auto_extension) as usize - ptr as usize },
        800usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(reset_auto_extension)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).result_blob64) as usize - ptr as usize },
        804usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(result_blob64)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).result_text64) as usize - ptr as usize },
        808usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(result_text64)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).strglob) as usize - ptr as usize },
        812usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(strglob)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_dup) as usize - ptr as usize },
        816usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(value_dup)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_free) as usize - ptr as usize },
        820usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(value_free)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).result_zeroblob64) as usize - ptr as usize },
        824usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(result_zeroblob64)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bind_zeroblob64) as usize - ptr as usize },
        828usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(bind_zeroblob64)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_subtype) as usize - ptr as usize },
        832usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(value_subtype)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).result_subtype) as usize - ptr as usize },
        836usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(result_subtype)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status64) as usize - ptr as usize },
        840usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(status64)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).strlike) as usize - ptr as usize },
        844usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(strlike)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).db_cacheflush) as usize - ptr as usize },
        848usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(db_cacheflush)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).system_errno) as usize - ptr as usize },
        852usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(system_errno)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).trace_v2) as usize - ptr as usize },
        856usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(trace_v2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).expanded_sql) as usize - ptr as usize },
        860usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(expanded_sql)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).set_last_insert_rowid) as usize - ptr as usize },
        864usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(set_last_insert_rowid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prepare_v3) as usize - ptr as usize },
        868usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(prepare_v3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prepare16_v3) as usize - ptr as usize },
        872usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(prepare16_v3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bind_pointer) as usize - ptr as usize },
        876usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(bind_pointer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).result_pointer) as usize - ptr as usize },
        880usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(result_pointer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_pointer) as usize - ptr as usize },
        884usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(value_pointer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vtab_nochange) as usize - ptr as usize },
        888usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(vtab_nochange)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_nochange) as usize - ptr as usize },
        892usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(value_nochange)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vtab_collation) as usize - ptr as usize },
        896usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(vtab_collation)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).keyword_count) as usize - ptr as usize },
        900usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(keyword_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).keyword_name) as usize - ptr as usize },
        904usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(keyword_name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).keyword_check) as usize - ptr as usize },
        908usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(keyword_check)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).str_new) as usize - ptr as usize },
        912usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(str_new)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).str_finish) as usize - ptr as usize },
        916usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(str_finish)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).str_appendf) as usize - ptr as usize },
        920usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(str_appendf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).str_vappendf) as usize - ptr as usize },
        924usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(str_vappendf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).str_append) as usize - ptr as usize },
        928usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(str_append)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).str_appendall) as usize - ptr as usize },
        932usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(str_appendall)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).str_appendchar) as usize - ptr as usize },
        936usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(str_appendchar)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).str_reset) as usize - ptr as usize },
        940usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(str_reset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).str_errcode) as usize - ptr as usize },
        944usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(str_errcode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).str_length) as usize - ptr as usize },
        948usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(str_length)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).str_value) as usize - ptr as usize },
        952usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(str_value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).create_window_function) as usize - ptr as usize },
        956usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(create_window_function)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).normalized_sql) as usize - ptr as usize },
        960usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(normalized_sql)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stmt_isexplain) as usize - ptr as usize },
        964usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(stmt_isexplain)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_frombind) as usize - ptr as usize },
        968usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(value_frombind)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).drop_modules) as usize - ptr as usize },
        972usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(drop_modules)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hard_heap_limit64) as usize - ptr as usize },
        976usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(hard_heap_limit64)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).uri_key) as usize - ptr as usize },
        980usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(uri_key)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).filename_database) as usize - ptr as usize },
        984usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(filename_database)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).filename_journal) as usize - ptr as usize },
        988usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(filename_journal)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).filename_wal) as usize - ptr as usize },
        992usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(filename_wal)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).create_filename) as usize - ptr as usize },
        996usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(create_filename)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).free_filename) as usize - ptr as usize },
        1000usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(free_filename)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).database_file_object) as usize - ptr as usize },
        1004usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(database_file_object)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).txn_state) as usize - ptr as usize },
        1008usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(txn_state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).changes64) as usize - ptr as usize },
        1012usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(changes64)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).total_changes64) as usize - ptr as usize },
        1016usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(total_changes64)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).autovacuum_pages) as usize - ptr as usize },
        1020usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(autovacuum_pages)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).error_offset) as usize - ptr as usize },
        1024usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(error_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vtab_rhs_value) as usize - ptr as usize },
        1028usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(vtab_rhs_value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vtab_distinct) as usize - ptr as usize },
        1032usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(vtab_distinct)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vtab_in) as usize - ptr as usize },
        1036usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(vtab_in)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vtab_in_first) as usize - ptr as usize },
        1040usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(vtab_in_first)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).vtab_in_next) as usize - ptr as usize },
        1044usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(vtab_in_next)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).deserialize) as usize - ptr as usize },
        1048usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(deserialize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).serialize) as usize - ptr as usize },
        1052usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(serialize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).db_name) as usize - ptr as usize },
        1056usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(db_name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_encoding) as usize - ptr as usize },
        1060usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(value_encoding)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).is_interrupted) as usize - ptr as usize },
        1064usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(is_interrupted)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stmt_explain) as usize - ptr as usize },
        1068usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(stmt_explain)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).get_clientdata) as usize - ptr as usize },
        1072usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(get_clientdata)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).set_clientdata) as usize - ptr as usize },
        1076usize,
        concat!(
            "Offset of field: ",
            stringify!(sqlite3_api_routines),
            "::",
            stringify!(set_clientdata)
        )
    );
}
pub type sqlite3_loadext_entry = ::core::option::Option<
    unsafe extern "C" fn(
        db: *mut sqlite3,
        pzErrMsg: *mut *mut ::core::ffi::c_char,
        pThunk: *const sqlite3_api_routines,
    ) -> ::core::ffi::c_int,
>;
pub type __builtin_va_list = *mut ::core::ffi::c_void;
